[{"title": "Best Brownies", "total_time": 60, "yields": "16 brownies", "ingredients": ["½ cup butter", "1 cup white sugar", "2 eggs", "1 teaspoon vanilla extract", "⅓ cup unsweetened cocoa powder", "½ cup all-purpose flour", "¼ teaspoon salt", "¼ teaspoon baking powder", "3 tablespoons butter, softened", "3 tablespoons unsweetened cocoa powder", "1 tablespoon honey", "1 teaspoon vanilla extract", "1 cup confectioners' sugar"], "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan.\nIn a large saucepan, melt 1/2 cup butter. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, 1/2 cup flour, salt, and baking powder. Spread batter into prepared pan.\nBake in preheated oven for 25 to 30 minutes. Do not overcook.\nTo Make Frosting:  Combine 3 tablespoons softened butter, 3 tablespoons cocoa, honey, 1 teaspoon vanilla extract, and 1 cup confectioners' sugar. Stir until smooth. Frost brownies while they are still warm.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3850414.jpg"}, {"title": "Pantry Chicken Casserole", "total_time": 55, "yields": "10 serving(s)", "ingredients": ["cooking spray", "1 (16 ounce) package penne pasta", "4 tablespoons salted butter", "1 large onion, chopped", "1 green bell pepper - stemmed, seeded, and finely chopped", "1 (8 ounce) package sliced fresh mushrooms", "3 cloves garlic, minced", "2 (8 ounce) packages processed cheese food (such as Velveeta®), cubed", "1 (14.5 ounce) can diced tomatoes, undrained", "1 (10 ounce) can diced tomatoes and green chiles (such as RO*TEL®), undrained", "1 (4 ounce) can mild chopped green chile peppers", "4 cups cooked chicken, cut into bite-sized pieces"], "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Spray a large casserole dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain.\nWhile the pasta is cooking, melt butter in a large skillet over medium heat. Add onion and bell pepper and cook, stirring occasionally, until vegetables are tender, about 5 minutes. Add mushrooms and cook until they release their liquid, about 5 minutes. Add garlic and cook, stirring occasionally, until fragrant, about 1 minute.\nStir in processed cheese food, diced tomatoes and juice, diced tomatoes and green chiles with juice, and mild chile peppers. Cook and stir until cheese has melted, 5 to 10 minutes. Remove from heat and stir in cooked pasta and chicken. Pour into the prepared baking dish.\nBake in the preheated oven until heated through, about 20 minutes. Serve warm.", "image": "https://images.media-allrecipes.com/userphotos/560x315/7847380.jpg"}, {"title": "Easy Korean Ground Beef Bowl", "total_time": 25, "yields": "4 bowls", "ingredients": ["1 pound lean ground beef", "5 cloves garlic, crushed", "1 tablespoon freshly grated ginger", "2 teaspoons toasted sesame oil", "½ cup reduced-sodium soy sauce", "⅓ cup light brown sugar", "¼ teaspoon crushed red pepper", "6 green onions, chopped, divided", "4 cups hot cooked brown rice", "1 tablespoon toasted sesame seeds"], "instructions": "Heat a large skillet over medium-high heat. Add beef and cook, stirring and crumbling into small pieces until browned, 5 to 7 minutes. Drain excess grease.\nAdd garlic, ginger, and sesame oil, stirring until fragrant, about 2 minutes. Stir in soy sauce, brown sugar, and red pepper. Cook until some of the sauce absorbs into the beef, about 7 minutes. Add 1/2 of the chopped green onions.\nServe beef over hot cooked rice; garnished with sesame seeds and remaining green onions.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5759837.jpg"}, {"title": "Best Chocolate Chip Cookies", "total_time": 60, "yields": "4 dozen", "ingredients": ["1 cup butter, softened", "1 cup white sugar", "1 cup packed brown sugar", "2 eggs", "2 teaspoons vanilla extract", "1 teaspoon baking soda", "2 teaspoons hot water", "½ teaspoon salt", "3 cups all-purpose flour", "2 cups semisweet chocolate chips", "1 cup chopped walnuts"], "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water.  Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.\nBake for about 10 minutes in the preheated oven, or until edges are nicely browned.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4462051.jpg"}, {"title": "Dill Pickle Soup", "total_time": 30, "yields": "8 serving(s)", "ingredients": ["2 tablespoons butter", "1/2 cup all-purpose flour", "7 cups chicken broth", "1/2 cup finely chopped dill pickles", "2 tablespoons dill pickle juice", "2 tablespoons white sugar", "1 tablespoon Worcestershire sauce", "2 teaspoons minced garlic", "4 teaspoons onion salt", "1 teaspoon dill weed", "1 teaspoon curry powder", "1/2 teaspoon white pepper", "2 bay leaves", "2 cups warm milk"], "instructions": "Melt butter in a large stockpot over medium heat. Whisk in flour, and cook until the flour just begins to turn from white to a pale beige, 1 to 2 minutes. Whisk in chicken broth until thickened and smooth. Increase heat to medium high, add dill pickles, pickle juice, sugar, Worcestershire sauce, garlic, onion salt, dill weed, curry powder, white pepper, and bay leaves. Bring to a simmer, then reduce heat to medium-low and simmer for 5 minutes, whisking frequently. Remove from heat and whisk in milk. Remove bay leaves before serving.", "image": "https://images.media-allrecipes.com/userphotos/560x315/6044491.jpg"}, {"title": "Fluffy Pancakes", "total_time": 25, "yields": "4 serving(s)", "ingredients": ["3/4 cup milk", "2 tablespoons white vinegar", "1 cup all-purpose flour", "2 tablespoons white sugar", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1 egg", "2 tablespoons butter, melted", "cooking spray"], "instructions": "Combine milk with vinegar in a medium bowl and set aside for 5 minutes to \"sour\".\nCombine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl. Whisk egg and butter into \"soured\" milk. Pour the flour mixture into the wet ingredients and whisk until lumps are gone.\nHeat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side.", "image": "https://images.media-allrecipes.com/userphotos/560x315/5079227.jpg"}, {"title": "To-Die-For Chicken Pot Pie", "total_time": 0, "yields": "1 pot pie", "ingredients": ["6 carrots, chopped", "6 stalks celery, chopped", "1 cup fresh or frozen peas", "1 cup fresh or frozen green beans, thawed", "1 cup corn kernels", "1 yellow onion, diced", "1 cup quartered red potatoes", "3 cups chicken broth", "1 teaspoon thyme", "½ teaspoon salt", "½ teaspoon ground black pepper", "4 (.87 ounce) packages dry chicken gravy mix", "4 cups water", "1 (15 ounce) package double crust ready-to-use pie crusts (such as Pillsbury®)", "1 whole roasted chicken, bones and skin removed, meat shredded", "¼ cup butter, cut into pieces", "1 egg", "¼ cup milk"], "instructions": "Preheat oven to 425 degrees F (220 degrees C). Place a baking sheet on the a rack on which you'll bake the pie.\n\nCombine the carrots, celery, peas, green beans, corn, onion, red potatoes, and chicken broth in a large pot. Season the vegetable mixture with thyme, salt, and black pepper; bring to a boil. Reduce heat to medium-low, cover, and simmer until the vegetables are tender, about 15 minutes. Drain the vegetables and set aside.\n\nPlace dry chicken gravy mix into another saucepan and gradually whisk in the water until smooth. Bring the mixture to a boil, reduce heat to medium-low, and simmer until thickened, about 1 minute. Set gravy aside and allow to continue to thicken as it cools.\n\nPress one of the pie crusts into the bottom of a 9-inch pie dish. Spoon a layer of gravy (about 1/3 cup) into the crust. Layer the cooked vegetables and shredded chicken into the crust until the filling is level with the top of the pie dish. Pour the rest of the gravy slowly over the filling until gravy is visible at the top. Scatter butter pieces over the filling; top with second crust. Seal the 2 crusts together and crimp with a fork.\n\nWhisk the egg and milk together in a bowl, and brush the egg wash over the top crust.  Pierce the top crust several times to vent steam.\n\nBake the pot pie in the preheated oven until the filling is bubbling and the crust is golden brown, about 45 minutes to 1 hour. Check periodically to see if the edge of the crust is browning too quickly; if needed, cover the edge with a strip of aluminum foil to prevent over-browning.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3086369.jpg"}, {"title": "Good Old Fashioned Pancakes", "total_time": 20, "yields": "8 serving(s)", "ingredients": ["1 1/2 cups all-purpose flour", "3 1/2 teaspoons baking powder", "1 teaspoon salt", "1 tablespoon white sugar", "1 1/4 cups milk", "1 egg", "3 tablespoons butter, melted"], "instructions": "In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.\nHeat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.", "image": "https://images.media-allrecipes.com/userphotos/560x315/4948036.jpg"}, {"title": "Janet's Rich Banana Bread", "total_time": 70, "yields": "1 9x5-inch loaf", "ingredients": ["½ cup butter, melted", "1 cup white sugar", "2 eggs", "1 teaspoon vanilla extract", "1 ½ cups all-purpose flour", "1 teaspoon baking soda", "½ teaspoon salt", "½ cup sour cream", "½ cup chopped walnuts", "2 medium bananas, sliced"], "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan.\nIn a large bowl, stir together the melted butter and sugar. Add the eggs and vanilla, mix well. Combine the flour, baking soda and salt, stir into the butter mixture until smooth. Finally, fold in the sour cream, walnuts and bananas. Spread evenly into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 60 minutes, or until a toothpick inserted into the center of the loaf comes out clean. Cool loaf in the pan for 10 minutes before removing to a wire rack to cool completely.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F171761.jpg"}, {"title": "Slow Cooker Creamy Chicken Taco Soup", "total_time": 165, "yields": "6 serving(s)", "ingredients": ["1 serving nonstick cooking spray", "1 cup diced onion", "1 cup diced bell pepper", "2 teaspoons salt, divided", "2 cups chicken broth", "1 (10 ounce) can diced tomatoes and green chiles (such as RO*TEL®)", "1 (10 ounce) can condensed cream of mushroom soup", "1 (4 ounce) can chopped green chiles (such as Ortega®)", "2 tablespoons oil", "1 tablespoon taco seasoning", "1/2 teaspoon ground cumin", "1/4 teaspoon ground black pepper", "1 pound skinless, boneless chicken breast", "1 (8 ounce) package Neufchatel cheese, softened"], "instructions": "Spray a slow cooker with cooking spray. Add onions, bell pepper, and 1 teaspoon salt. Stir in chicken broth, diced tomatoes, condensed soup, and chiles.\nCombine oil, taco seasoning, 1 teaspoon salt, cumin, and black pepper in a bowl. Add chicken and toss to coat on all sides. Transfer to the slow cooker.\nCook on Low until chicken is no longer pink in the center and the juices run clear, 2 to 3 hours. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from the slow cooker and shred.\nAdd Neufchatel cheese to the slow cooker and stir until melted. Return chicken to the slow cooker and cook until warmed through, 20 to 30 minutes more.", "image": "https://images.media-allrecipes.com/userphotos/560x315/8044940.jpg"}, {"title": "Simple Tomato Soup", "total_time": 30, "yields": "6 serving(s)", "ingredients": ["1 tablespoon unsalted butter or margarine", "1 tablespoon olive oil", "1 onion, thinly sliced", "2 large garlic cloves, peeled and crushed", "2 (28 ounce) cans whole peeled tomatoes", "1 cup water", "1 tablespoon sugar", "1 teaspoon salt, plus more to taste", "freshly ground black pepper to taste", "1 pinch red pepper flakes", "1/4 teaspoon celery seed", "1/4 teaspoon dried oregano"], "instructions": "Heat butter and olive oil in a large saucepan over medium-low heat and cook onion and garlic until onion is soft and translucent, about 5 minutes. Add tomatoes, water, sugar, salt, pepper, red pepper flakes, celery seed, and oregano. Bring to a boil. Reduce heat, cover, and simmer for 15 minutes.\nRemove from heat and puree with an immersion blender. Reheat soup until warm and season with more salt and pepper if desired.", "image": "https://images.media-allrecipes.com/userphotos/560x315/7964772.jpg"}, {"title": "Creamed Eggs on Toast", "total_time": 25, "yields": "6 serving(s)", "ingredients": ["12 hard-cooked eggs, peeled", "1/4 cup butter", "1/2 cup all-purpose flour", "3 cups milk", "1 tablespoon chicken bouillon granules", "6 slices white bread, lightly toasted", "salt and white pepper to taste"], "instructions": "Separate the egg whites from the egg yolks. Place the egg yolks into a bowl and mash with a fork. Chop the egg whites into small pieces and set aside.\nMelt the butter in a saucepan set over medium heat. Stir in flour until smooth. Gradually mix in the milk and chicken bouillon so that no lumps form and stir constantly until the mixture comes to a boil. Add the egg yolks and mix until dissolved. Stir in egg whites. Serve over toast and season with salt and white pepper.", "image": "https://images.media-allrecipes.com/userphotos/560x315/221205.jpg"}, {"title": "Cake Mix Cinnamon Rolls", "total_time": 120, "yields": "16 rolls", "ingredients": ["3 (.25 ounce) packages active dry yeast", "2 ½ cups warm water", "1 (18.25 ounce) package white cake mix", "4 ½ cups all-purpose flour", "½ cup butter, softened", "½ cup brown sugar", "2 teaspoons ground cinnamon", "¼ cup butter, melted", "⅓ cup white sugar", "¼ cup chopped pecans, or to taste"], "instructions": "In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine the yeast mixture with the cake mix and 3 cups of the flour; stir to combine. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\nLightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 30 minutes.\nDeflate the dough and turn it out onto a lightly floured surface. Roll the dough into a 10x16 inch rectangle. spread the softened butter over the rectangle; sprinkle on brown sugar and cinnamon. Starting from one of the long sides, roll up the rectangle and cut into 1-inch wide rolls.\nPreheat oven to 375 degrees F (190 degrees C). Grease a 9x13 inch baking pan.\nPour the melted butter into a small bowl. Mix the white sugar and pecans in another small bowl. Dip the top of each roll in the melted butter, then in the sugar and pecan mixture, then place the topped rolls snugly into the prepared pan. Cover the rolls with a damp cloth and let rise until doubled in volume, about 30 minutes.\nBake in the preheated oven for 20 minutes, or until rolls are golden.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F799169.jpg"}, {"title": "Shrimp and Zucchini Rice Bowl", "total_time": 25, "yields": "4 serving(s)", "ingredients": ["2 tablespoons olive oil, divided", "2 cups sliced green onions", "1/4 teaspoon salt, divided", "2 (8.8 ounce) packages UNCLE BEN'S® READY RICE® Whole Grain Brown Rice", "2 1/2 cups sliced zucchini", "3 cloves garlic, minced", "1 pound peeled and deveined large shrimp", "1/2 cup unsalted chicken stock", "1 tablespoon fresh lemon juice", "1 teaspoon Dijon mustard", "1 tablespoon unsalted butter", "1 tablespoon chopped fresh tarragon", "2 ounces goat cheese, crumbled", "Tarragon leaves for garnish (optional)"], "instructions": "Heat 1 tablespoon oil in a large skillet over medium-low heat. Add green onions and 1/8 teaspoon salt. Cover and cook until green onions are tender, stirring occasionally, about 3 minutes; add a tablespoon of water during cooking if green onions start to brown. Add rice to skillet; cook over medium heat 2 minutes or until thoroughly heated, stirring occasionally. Divide rice mixture evenly among 4 bowls.\nIncrease heat to medium-high and add remaining 1 tablespoon oil to skillet. Add zucchini and remaining 1/8 teaspoon salt; saute 3 minutes or until zucchini starts to soften. Add garlic and shrimp; cook 4 minutes or until shrimp are done. Divide mixture evenly among bowls.\nAdd chicken stock, lemon juice, and mustard to skillet, scraping pan to loosen browned bits; cook 3 minutes or until sauce slightly thickens. Remove from heat, and stir in butter and tarragon. Drizzle sauce evenly over bowls. Sprinkle with goat cheese. Garnish with additional tarragon, if desired.", "image": "https://images.media-allrecipes.com/userphotos/560x315/7865474.jpg"}, {"title": "Island Kielbasa in a Slow Cooker", "total_time": 310, "yields": "6 serving(s)", "ingredients": ["2 pounds kielbasa sausage, sliced into 1/2 inch pieces", "2 cups ketchup", "2 cups brown sugar", "1 (15 ounce) can pineapple chunks, undrained"], "instructions": "Place the sausage, ketchup, sugar and pineapple in the slow cooker and mix together.\nCook on low setting for 5 to 6 hours, until sausage is cooked through.", "image": "https://images.media-allrecipes.com/userphotos/560x315/282459.jpg"}, {"title": "Two-Ingredient Pizza Dough", "total_time": 15, "yields": "8 serving(s)", "ingredients": ["1 1/2 cups self-rising flour, plus more for kneading", "1 cup plain Greek yogurt", "cooking spray"], "instructions": "Mix flour and Greek yogurt together in a bowl; transfer to a work surface floured with self-rising flour. Knead dough, adding more flour as needed to keep dough from being too sticky, for 8 to 10 minutes.\nSpray a 12-inch pizza pan with cooking spray and spread dough to edges of pan.", "image": "https://images.media-allrecipes.com/userphotos/560x315/2580346.jpg"}, {"title": "World's Best Lasagna", "total_time": 195, "yields": "None", "ingredients": ["1 pound sweet Italian sausage", "¾ pound lean ground beef", "½ cup minced onion", "2 cloves garlic, crushed", "1 (28 ounce) can crushed tomatoes", "2 (6 ounce) cans tomato paste", "2 (6.5 ounce) cans canned tomato sauce", "½ cup water", "2 tablespoons white sugar", "1 ½ teaspoons dried basil leaves", "½ teaspoon fennel seeds", "1 teaspoon Italian seasoning", "1 ½ teaspoons salt, divided, or to taste", "¼ teaspoon ground black pepper", "4 tablespoons chopped fresh parsley", "12 lasagna noodles", "16 ounces ricotta cheese", "1 egg", "¾ pound mozzarella cheese, sliced", "¾ cup grated Parmesan cheese"], "instructions": "In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 teaspoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water.  In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.\nPreheat oven to 375  degrees F (190 degrees C).\nTo assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13 inch baking dish.  Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese.  Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.\nBake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3359675.jpg"}, {"title": "Shrimp and Sugar Snap Peas", "total_time": 30, "yields": "8 serving(s)", "ingredients": ["1 (16 ounce) package uncooked linguini pasta", "2 tablespoons olive oil", "1 teaspoon chili oil", "1 1/2 pounds medium shrimp, peeled and deveined", "1 pound sugar snap pea pods", "2 large cloves garlic, minced", "1 1/2 cups dry white wine", "1/4 cup reserved pasta water", "1 tablespoon unsalted butter", "1 tablespoon fresh lemon juice", "1/3 cup chopped fresh basil"], "instructions": "Bring a large pot of lightly salted water to a boil. Add linguini pasta, and cook for 8 to 10 minutes or until al dente. Drain, reserving 1/4 cup liquid.\nHeat the olive oil and chili oil in a wok over medium-high heat. Mix in the shrimp, pea pods, and garlic. Cook and stir 2 minutes, until shrimp are almost opaque. Remove from heat, and set aside.\nPour the wine into the wok, and bring to a boil. Cook until reduced by 1/3. Return shrimp, peas, and garlic to the wok, and stir in the reserved pasta water. Continue to cook and stir until shrimp are opaque. Remove wok from heat, and mix in the butter, lemon juice, and basil. Toss with the cooked pasta to serve.", "image": "https://images.media-allrecipes.com/userphotos/560x315/961624.jpg"}, {"title": "Banana Banana Bread", "total_time": 80, "yields": "1 loaf", "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking soda", "¼ teaspoon salt", "½ cup butter", "¾ cup brown sugar", "2 eggs, beaten", "2 ⅓ cups mashed overripe bananas"], "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\nIn a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.\nBake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4565477.jpg"}, {"title": "Slow Cooker Barbecue Chicken Breast", "total_time": 365, "yields": "2 serving(s)", "ingredients": ["2 boneless chicken breasts", "1/2 teaspoon salt", "1/2 teaspoon ground black pepper", "1 (18 ounce) bottle barbecue sauce, divided", "3 tablespoons apple cider vinegar", "3 tablespoons brown sugar", "1 teaspoon onion powder", "1 teaspoon garlic powder", "1/2 teaspoon red pepper flakes"], "instructions": "Season chicken breasts with salt and pepper on all sides. Place in slow cooker and pour 1/4 cup barbecue sauce and vinegar on top.\nCook on Low for 3 hours.\nCombine brown sugar, onion powder, garlic powder, and red pepper flakes in a small bowl.\nPour out all the liquid from the slow cooker and add remaining barbecue sauce. Sprinkle chicken with brown sugar-spice mixture.\nCook on Low, stirring occasionally, until chicken is no longer pink in the center and the juices run clear, about 3 more hours. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).", "image": "https://images.media-allrecipes.com/userphotos/560x315/7425512.jpg"}, {"title": "Chicken Parmesan", "total_time": 0, "yields": "4 servings", "ingredients": ["4 eaches skinless, boneless chicken breast halves", "1 pinch salt and freshly ground black pepper to taste", "2 eggs", "1 cup panko bread crumbs, or more as needed", "½ cup grated Parmesan cheese", "2 tablespoons all-purpose flour, or more if needed", "1 cup olive oil for frying", "½ cup prepared tomato sauce", "¼ cup fresh mozzarella, cut into small cubes", "¼ cup chopped fresh basil", "½ cup grated provolone cheese", "¼ cup grated Parmesan cheese", "1 tablespoon olive oil"], "instructions": "Preheat an oven to 450 degrees F (230 degrees C).\n\nPlace chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. Season chicken thoroughly with salt and pepper.\n\nBeat eggs in a shallow bowl and set aside.\n\nMix bread crumbs and 1/2 cup Parmesan cheese in a separate bowl, set aside.\n\nPlace flour in a sifter or strainer; sprinkle over chicken breasts, evenly coating both sides.\n\nDip flour coated chicken breast in beaten eggs. Transfer breast to breadcrumb mixture, pressing the crumbs into both sides. Repeat for each breast. Set aside breaded chicken breasts for about 15 minutes.\n\nHeat 1 cup olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken until golden, about 2 minutes on each side. The chicken will finish cooking in the oven.\n\nPlace chicken in a baking dish and top each breast with about 1/3 cup of tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle 1 to 2 tablespoons of Parmesan cheese on top and drizzle with 1 tablespoon olive oil.\n\nBake in the preheated oven until cheese is browned and bubbly, and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6635156.jpg"}, {"title": "Garlic Roasted Chicken and Potatoes", "total_time": 0, "yields": "8 servings", "ingredients": ["¼ cup butter", "6 chicken leg quarters, split into drumsticks and thighs", "6 large Yukon Gold potatoes, cut into chunks", "24 cloves garlic, unpeeled", "1 pinch salt and ground black pepper to taste", "¼ cup maple syrup"], "instructions": "Preheat oven to 400 degrees F (200 degrees C).\n\nPlace the butter into a roasting pan, and melt in the oven. When butter is melted, swirl to coat the bottom of the roasting pan, and place the chicken drumsticks and thighs, potatoes, and unpeeled garlic cloves into the pan. Sprinkle with salt and black pepper; turn the chicken, potatoes, and garlic to coat with butter.\n\nBake in the preheated oven until the chicken is no longer pink inside and the juices run clear, about 40 minutes, basting 3 times with pan drippings. Brush maple syrup over the chicken pieces, and spoon pan drippings over the potatoes.\n\nReturn to oven, and bake until the chicken and potatoes are tender and browned, about 20 more minutes. An instant-read thermometer inserted into a thick part of a thigh should read at least 165 degrees F (74 degrees C). To serve, squeeze garlic from the baked cloves, and spread the soft garlic over the chicken. Pour pan juices over chicken and potatoes.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1251350.jpg"}, {"title": "Taco Bell® Seasoning Copycat", "total_time": 10, "yields": "4 serving(s)", "ingredients": ["1 tablespoon dried onion flakes", "1 teaspoon all-purpose flour", "1 teaspoon beef bouillon granules", "1 teaspoon garlic salt", "1 teaspoon ground cumin", "1 teaspoon paprika", "1 teaspoon chili powder", "1/4 teaspoon cayenne pepper", "1/4 teaspoon white sugar"], "instructions": "Whisk onion flakes, flour, beef bouillon, garlic salt, cumin, paprika, chili powder, cayenne pepper, and sugar together in a bowl.", "image": "https://images.media-allrecipes.com/userphotos/560x315/1103510.jpg"}, {"title": "To Die For Blueberry Muffins", "total_time": 40, "yields": "8 large muffins", "ingredients": ["1 ½ cups all-purpose flour", "¾ cup white sugar", "½ teaspoon salt", "2 teaspoons baking powder", "⅓ cup vegetable oil", "1 egg", "⅓ cup milk, or more as needed", "1 cup fresh blueberries", "½ cup white sugar", "⅓ cup all-purpose flour", "¼ cup butter, cubed", "1 ½ teaspoons ground cinnamon"], "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease muffin cups or line with muffin liners.\nCombine 1 1/2 cups flour, 3/4 cup sugar, salt and baking powder. Place vegetable oil into a 1 cup measuring cup; add the egg and add enough milk to reach the 1-cup mark. Mix this with flour mixture. Fold in blueberries. Fill muffin cups right to the top, and sprinkle with crumb topping mixture.\nTo Make Crumb Topping: Mix together 1/2 cup sugar, 1/3 cup flour, 1/4 cup butter,  and 1 1/2 teaspoons cinnamon. Mix with fork, and sprinkle over muffins before baking.\nBake for 20 to 25 minutes in the preheated oven, or until done.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F662790.jpg"}, {"title": "Amazing Crusted Chicken", "total_time": 60, "yields": "None", "ingredients": ["2 cups cheese flavored crackers (such as Cheez-It&reg;), crushed", "1 cup French-fried onions, crushed", "½ cup Italian bread crumbs", "2 teaspoons sesame seed, toasted", "salt and ground black pepper to taste", "4 skinless, boneless chicken breast halves - cut in half", "3 tablespoons mayonnaise"], "instructions": "Preheat oven to 450 degrees F (230 degrees C). Spray a baking dish with cooking spray.\nMix cheese-flavored crackers, French-fried onions, Italian bread crumbs, sesame seeds, salt, and pepper in a bowl. Set aside.\nWash and pat chicken breasts dry. Spread a thin layer of mayonnaise on one side of each piece and place mayonnaise-side down in the cracker mixture. Spread a thin layer of mayonnaise on the other side of the chicken and cover with the cracker mixture, patting firmly into the chicken. Place chicken breasts on the prepared baking dish. Sprinkle remaining cracker mixture on top; lightly spray the chicken with cooking spray.\nBake in the preheated oven until the chicken breasts are no longer pink in the center and the juices run clear, 35 to 40 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6531376.jpg"}, {"title": "Spinach Salad with Chicken, Avocado, and Goat Cheese", "total_time": 0, "yields": "4 servings", "ingredients": ["¼ cup pine nuts", "8 cups chopped spinach", "1 cup halved cherry tomatoes", "1 ½ cups chopped cooked chicken", "1 large avocado - peeled, pitted, and sliced", "½ cup corn kernels", "⅓ cup crumbled goat cheese", "3 tablespoons white wine vinegar", "2 tablespoons extra-virgin olive oil", "1 tablespoon Dijon mustard", "1 pinch salt and ground black pepper to taste"], "instructions": "Heat a small skillet over medium-high heat. Toast pine nuts in hot skillet until lightly browned and fragrant, 3 to 5 minutes.\n\nPut spinach into a large salad bowl; top with pine nuts, tomatoes, chicken, avocado, corn kernels, and goat cheese.\n\nBeat white wine vinegar, olive oil, and Dijon mustard together in a small bowl until smooth; season with salt and pepper. Drizzle dressing over the salad and toss lightly to coat.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1825810.jpg"}, {"title": "Steak N Gravy", "total_time": 90, "yields": "4 serving(s)", "ingredients": ["4 (4 ounce) venison steaks", "1 cup all-purpose flour", "2 tablespoons ground bay leaves", "1 pinch salt and pepper", "4 tablespoons olive oil, divided", "1/2 onion, chopped", "6 fresh mushrooms, sliced", "1 tablespoon minced garlic", "1 (10.5 ounce) can beef gravy", "1/4 cup milk"], "instructions": "Cut all fat and gristle off the meat, and pound each steak out with a meat tenderizer until they are thin but not tearing. In a shallow bowl, combine flour, bay leaf, salt and pepper. Dredge steaks in the flour mixture until evenly coated.\nHeat 1 tablespoon olive oil in a large heavy skillet over medium heat. Saute onions until soft and translucent. Stir in mushrooms and garlic, and cook until tender. Remove from skillet and set aside. Heat remaining oil, and fry each steak for 2 minutes on each side, or until golden brown. Return onion mixture to skillet. Stir in gravy and milk. Reduce heat, cover, and simmer for 30 to 40 minutes. Stir occasionally to prevent sticking.", "image": "https://images.media-allrecipes.com/userphotos/560x315/1639131.jpg"}, {"title": "Coconut-Curry Lentil Stew Served over Quinoa", "total_time": 60, "yields": "12 serving(s)", "ingredients": ["2 cups quinoa", "3 1/2 cups water", "1 tablespoon salt", "2 tablespoons coconut oil", "1 small onion, chopped", "6 cloves garlic, minced", "5 large tomatoes, chopped", "1 cup water", "1 (14 ounce) can coconut milk", "1 tablespoon molasses", "1/4 cup coconut powder", "1 (4 inch) cinnamon stick", "3 tablespoons curry powder", "2 tablespoons ground coriander", "2 cups red lentils", "salt and pepper to taste", "1 bunch fresh cilantro, chopped"], "instructions": "Soak the quinoa in a bowl filled with cold water for 5 minutes, then drain using a fine mesh strainer, and rinse with running water. Set the strainer aside so the quinoa can drain, then bring 3 1/2 cups of water and 1 tablespoon of salt to a boil in a saucepan. Stir in the quinoa, cover, and reduce the heat to medium-low. Simmer until the quinoa has absorbed the liquid and is tender, about 15 minutes. Set aside, and keep warm.\nMelt the coconut oil in a large saucepan over medium heat. Add the onion and garlic; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the tomatoes, and cook for 5 minutes more. Pour in the water and coconut milk, and add the molasses, coconut powder, cinnamon, curry powder, and ground coriander. Bring to a simmer over medium-high heat, then stir in the lentils, and cook until just tender, 10 to 15 minutes. Stir frequently as the lentils cook to keep them from sticking. Be careful not to overcook them, as they will quickly loose shape and become a paste.\nOnce the lentils are done, season to taste with salt and pepper, and stir in the chopped cilantro. Serve the lentil stew over a bed of quinoa.", "image": "https://images.media-allrecipes.com/userphotos/560x315/1589119.jpg"}, {"title": "Amish White Bread", "total_time": 150, "yields": "2 - 9x5 inch loaves", "ingredients": ["2 cups warm water (110 degrees F/45 degrees C)", "⅔ cup white sugar", "1 ½ tablespoons active dry yeast", "1 ½ teaspoons salt", "¼ cup vegetable oil", "6 cups bread flour"], "instructions": "In a large bowl, dissolve the sugar in warm water, and then stir in yeast. Allow to proof until yeast resembles a creamy foam.\nMix salt and oil into the yeast. Mix in flour one cup at a time. Knead dough on a lightly floured surface until smooth. Place in a well oiled bowl, and turn dough to coat. Cover with a damp cloth. Allow to rise until doubled in bulk, about 1 hour.\nPunch dough down. Knead for a few minutes, and divide in half. Shape into loaves, and place into two well oiled 9x5 inch loaf pans. Allow to rise for 30 minutes, or until dough has risen 1 inch above pans.\nBake at 350 degrees F (175 degrees C) for 30 minutes.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F731540.jpg"}, {"title": "Taco Seasoning I", "total_time": 1, "yields": "10 serving(s)", "ingredients": ["1 tablespoon chili powder", "1/4 teaspoon garlic powder", "1/4 teaspoon onion powder", "1/4 teaspoon crushed red pepper flakes", "1/4 teaspoon dried oregano", "1/2 teaspoon paprika", "1 1/2 teaspoons ground cumin", "1 teaspoon sea salt", "1 teaspoon black pepper"], "instructions": "In a small bowl, mix together chili powder, garlic powder, onion powder, red pepper flakes, oregano, paprika, cumin, salt and pepper. Store in an airtight container.", "image": "https://images.media-allrecipes.com/userphotos/560x315/4538211.jpg"}, {"title": "Guacamole", "total_time": 10, "yields": "None", "ingredients": ["3 avocados - peeled, pitted, and mashed", "1 lime, juiced", "1 teaspoon salt", "½ cup diced onion", "3 tablespoons chopped fresh cilantro", "2 roma (plum) tomatoes, diced", "1 teaspoon minced garlic", "1 pinch ground cayenne pepper (optional)"], "instructions": "In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4521556.jpg"}, {"title": "Root Beer Pork Chops", "total_time": 160, "yields": "4 pork chops", "ingredients": ["4 (1-inch thick) pork chops", "3 (12 fluid ounce) cans or bottles root beer", "salt and pepper to taste", "1 cup beef stock", "2 tablespoons brown sugar", "½ teaspoon chipotle-flavored hot sauce", "2 teaspoons Worcestershire sauce", "1 pinch salt, to taste"], "instructions": "Place the pork chops in a dish; pour 2 cans of the root beer over the chops. Place in refrigerator to marinate at least 2 hours. Remove the pork chops from the root beer; season with salt and pepper.\nCombine the remaining can of root beer, the beef stock, brown sugar, hot sauce, and Worcestershire sauce in a saucepan over medium heat; simmer the mixture until it reduces to about 3/4 cup. Set aside.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nGrill the pork chops on the preheated grill until the no longer pink in the center, about 8 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Brush the chops generously with the reduction sauce and continue cooking for about 2 minutes more per side. Remove from grill and brush with any remaining sauce. Season with salt to taste before serving.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F620286.jpg"}, {"title": "Banana Crumb Muffins", "total_time": 35, "yields": "10 muffins", "ingredients": ["1 ½ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon baking powder", "½ teaspoon salt", "3 bananas, mashed", "¾ cup white sugar", "1 egg, lightly beaten", "⅓ cup butter, melted", "⅓ cup packed brown sugar", "2 tablespoons all-purpose flour", "⅛ teaspoon ground cinnamon", "1 tablespoon butter"], "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease 10 muffin cups, or line with muffin papers.\nIn a large bowl, mix together 1 1/2 cups flour, baking soda, baking powder and salt. In another bowl, beat together bananas, sugar, egg and melted butter. Stir the banana mixture into the flour mixture just until moistened. Spoon batter into prepared muffin cups.\nIn a small bowl, mix together brown sugar, 2 tablespoons flour and cinnamon. Cut in 1 tablespoon butter until mixture resembles coarse cornmeal. Sprinkle topping over muffins.\nBake in preheated oven for 18 to 20 minutes, until a toothpick inserted into center of a muffin comes out clean.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F428420.jpg"}, {"title": "Ramen Carbonara", "total_time": 20, "yields": "None", "ingredients": ["2 slices bacon, chopped", "½ cup chopped onion", "2 (3 ounce) packages ramen noodles (flavor packets discarded)", "½ cup frozen peas", "1 egg", "½ cup shredded Parmesan cheese", "¼ teaspoon kosher salt", "1 pinch red pepper flakes", "Chopped fresh parsley"], "instructions": "Cook bacon in a large skillet over medium heat until crisp, about 5 minutes. Transfer to paper towels to drain. Add onion to bacon drippings in skillet; cook until tender, 3 to 5 minutes.\nMeanwhile, cook ramen in a saucepan according to package directions, adding peas the last minute of cooking. Reserve 1/2 cup cooking water; drain.\nWhisk together egg, Parmesan, onion and drippings, salt, and red pepper in a bowl. Add hot ramen and cooked bacon. Toss to coat, adding enough reserved cooking water to make a creamy consistency. Top servings with parsley.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6864017.jpg"}, {"title": "Chicken Ranch Enchiladas", "total_time": 0, "yields": "1 - 9x13 inch dish", "ingredients": ["¼ cup butter", "4 eaches skinless, boneless chicken breast halves - cut into 1/2 inch cubes", "1 (10.75 ounce) can condensed cream of chicken soup", "1 (16 ounce) container sour cream", "1 (4.5 ounce) can chopped green chilies", "1 (1 ounce) package ranch dressing mix", "10 (8 inch) flour tortillas", "2 cups shredded Mexican cheese blend"], "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\n\nMelt the butter in a large skillet over medium-high heat. Stir in the chicken and cook until no longer pink in the center, about 7 minutes. Whisk together the condensed cream of chicken soup, sour cream, chiles, and ranch dressing in a bowl; spread a thin layer of the mixture into a 9x13 inch baking dish.\n\nSpoon about 2 tablespoons of sauce into each tortilla; divide the chicken among the tortillas and sprinkle with 3/4 of the cheese. Roll the tortillas into cylinders and place seam-side-down into the baking dish. Pour the remaining sauce over the enchiladas and cover the dish with aluminum foil.\n\nBake in the preheated oven until hot, about 35 minutes. Remove the foil and sprinkle with the remaining cheese. Return to the oven and cook a few more minutes until the cheese melts.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6390130.jpg"}, {"title": "Baked Oatmeal II", "total_time": 50, "yields": "8 serving(s)", "ingredients": ["3 cups rolled oats", "1 cup brown sugar", "2 teaspoons ground cinnamon", "2 teaspoons baking powder", "1 teaspoon salt", "1 cup milk", "2 eggs", "1/2 cup melted butter", "2 teaspoons vanilla extract", "3/4 cup dried cranberries"], "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together oats, brown sugar, cinnamon, baking powder, and salt. Beat in milk, eggs, melted butter, and vanilla extract. Stir in dried cranberries. Spread into a 9x13 inch baking dish.\nBake in preheated oven for 40 minutes.", "image": "https://images.media-allrecipes.com/userphotos/560x315/462182.jpg"}, {"title": "Baked Teriyaki Chicken", "total_time": 0, "yields": "6 servings", "ingredients": ["1 tablespoon cornstarch", "1 tablespoon cold water", "½ cup white sugar", "½ cup soy sauce", "¼ cup cider vinegar", "1 clove garlic, minced", "½ teaspoon ground ginger", "¼ teaspoon ground black pepper", "12 skinless chicken thighs"], "instructions": "In a small saucepan over low heat, combine the cornstarch, cold water, sugar, soy sauce, vinegar, garlic, ginger and ground black pepper. Let simmer, stirring frequently, until sauce thickens and bubbles.\n\nPreheat oven to 425 degrees F (220 degrees C).\n\nPlace chicken pieces in a lightly greased 9x13 inch baking dish. Brush chicken with the sauce. Turn pieces over, and brush again.\n\nBake in the preheated oven for 30 minutes. Turn pieces over, and bake for another 30 minutes, until no longer pink and juices run clear. Brush with sauce every 10 minutes during cooking.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4530047.jpg"}, {"title": "Chicken Pot Pie IX", "total_time": 0, "yields": "1 9-inch pie", "ingredients": ["1 pound skinless, boneless chicken breast halves - cubed", "1 cup sliced carrots", "1 cup frozen green peas", "½ cup sliced celery", "⅓ cup butter", "⅓ cup chopped onion", "⅓ cup all-purpose flour", "½ teaspoon salt", "¼ teaspoon black pepper", "¼ teaspoon celery seed", "1 ¾ cups chicken broth", "⅔ cup milk", "2 (9 inch) unbaked pie crusts"], "instructions": "Preheat oven to 425 degrees F (220 degrees C.)\n\nIn a saucepan, combine chicken, carrots, peas, and celery. Add water to cover and boil for 15 minutes. Remove from heat, drain and set aside.\n\nIn the saucepan over medium heat, cook onions in butter until soft and translucent. Stir in flour, salt, pepper, and celery seed. Slowly stir in chicken broth and milk. Simmer over medium-low heat until thick. Remove from heat and set aside.\n\nPlace the chicken mixture in bottom pie crust. Pour hot liquid mixture over. Cover with top crust, seal edges, and cut away excess dough. Make several small slits in the top to allow steam to escape.\n\nBake in the preheated oven for 30 to 35 minutes, or until pastry is golden brown and filling is bubbly. Cool for 10 minutes before serving.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4535759.jpg"}, {"title": "Best Potatoes You'll Ever Taste", "total_time": 30, "yields": "None", "ingredients": ["3 tablespoons mayonnaise", "2 cloves garlic, crushed", "1 teaspoon dried oregano", "salt and pepper to taste", "5 potatoes, quartered"], "instructions": "In a small bowl, mix mayonnaise, garlic, oregano, salt , and pepper. Set aside.\nBring a large pot of salted water to a boil.  Add potatoes, and cook until almost done, about 10 minutes. Don't overcook otherwise the potatoes will break apart. Drain, and cool.\nPreheat oven broiler. Line a baking tray with aluminum foil, and lightly grease the aluminum foil.\nArrange potatoes in the prepared baking tray. Spoon the mayonnaise mixture over the potatoes. Place on the prepared grill, and cook until potatoes are tender and mayonnaise mixture is lightly browned, about 10 minutes.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2326066.jpg"}, {"title": "Easy Meatloaf", "total_time": 70, "yields": "None", "ingredients": ["1 ½ pounds ground beef", "1 egg", "1 onion, chopped", "1 cup milk", "1 cup dried bread crumbs", "salt and pepper to taste", "2 tablespoons brown sugar", "2 tablespoons prepared mustard", "⅓ cup ketchup"], "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine the beef, egg, onion, milk and bread OR cracker crumbs. Season with salt and pepper to taste and place in a lightly greased 5x9 inch loaf pan, OR form into a loaf and place in a lightly greased 9x13 inch baking dish.\nIn a separate small bowl, combine the brown sugar, mustard and ketchup. Mix well and pour over the meatloaf.\nBake at 350 degrees F (175 degrees C) for 1 hour.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7698881.jpg"}, {"title": "Shrimp Scampi with Pasta", "total_time": 40, "yields": "6 serving(s)", "ingredients": ["1 (16 ounce) package linguine pasta", "2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "2 shallots, finely diced", "2 cloves garlic, minced", "1 pinch red pepper flakes (optional)", "1 pound shrimp, peeled and deveined", "1 pinch kosher salt and freshly ground pepper", "1/2 cup dry white wine", "1 lemon, juiced", "2 tablespoons butter", "2 tablespoons extra-virgin olive oil", "1/4 cup finely chopped fresh parsley leaves", "1 teaspoon extra-virgin olive oil, or to taste"], "instructions": "Bring a large pot of salted water to a boil; cook linguine in boiling water until nearly tender, 6 to 8 minutes. Drain.\nMelt 2 tablespoons butter with 2 tablespoons olive oil in a large skillet over medium heat. Cook and stir shallots, garlic, and red pepper flakes in the hot butter and oil until shallots are translucent, 3 to 4 minutes. Season shrimp with kosher salt and black pepper; add to the skillet and cook until pink, stirring occasionally, 2 to 3 minutes. Remove shrimp from skillet and keep warm.\nPour white wine and lemon juice into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Melt 2 tablespoons butter in skillet, stir 2 tablespoons olive oil into butter mixture, and bring to a simmer. Toss linguine, shrimp, and parsley in the butter mixture until coated; season with salt and black pepper. Drizzle with 1 teaspoon olive oil to serve.", "image": "https://images.media-allrecipes.com/userphotos/560x315/2606852.jpg"}, {"title": "One-Pot Shrimp Scampi Orzo", "total_time": 45, "yields": "2 serving(s)", "ingredients": ["Marinade:", "1 tablespoon olive oil", "1 teaspoon lemon zest", "1 teaspoon lemon juice", "1 pinch red pepper flakes", "1/2 teaspoon dried parsley", "1/2 pound uncooked medium shrimp, peeled and deveined", "1 tablespoon butter", "1 tablespoon olive oil", "3/4 cup orzo", "1/2 cup finely diced onion", "1 large clove garlic, minced", "1/4 cup white wine", "1 1/4 cups low-sodium chicken broth", "1/2 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "1/2 cup frozen peas, defrosted", "1/2 tablespoon chopped fresh parsley", "2 lemon slices"], "instructions": "Combine olive oil, lemon zest, lemon juice, red pepper flakes, and dried parsley in a small bowl. Add shrimp and toss to coat. Marinate for 15 to 20 minutes.\nMelt butter in a pot over medium-high heat. Add olive oil. Stir in orzo and onion, toss to coat, and cook, stirring frequently, until onions are translucent and orzo is lightly toasted, 4 to 5 minutes. Mix in garlic and cook until fragrant, about 30 seconds.\nDeglaze pot with white wine and stir until wine has cooked off. Pour in chicken broth and season with salt and pepper. Cook, stirring frequently, until orzo is tender yet firm to the bite, 8 to 10 minutes. Add peas and shrimp with marinade to the pot, cover, and cook, stirring occasionally, until shrimp are light pink, 3 to 4 minutes.\nDivide between 2 dishes, sprinkle with fresh parsley, and garnish with lemon slices.", "image": "https://images.media-allrecipes.com/userphotos/560x315/7816212.jpg"}, {"title": "Asian Orange Chicken", "total_time": 0, "yields": "4 servings", "ingredients": ["1 ½ cups water", "2 tablespoons orange juice", "¼ cup lemon juice", "⅓ cup rice vinegar", "2 ½ tablespoons soy sauce", "1 tablespoon grated orange zest", "1 cup packed brown sugar", "½ teaspoon minced fresh ginger root", "½ teaspoon minced garlic", "2 tablespoons chopped green onion", "¼ teaspoon red pepper flakes", "3 tablespoons cornstarch", "2 tablespoons water", "2 boneless, skinless chicken breasts, cut into 1/2 inch pieces", "1 cup all-purpose flour", "¼ teaspoon salt", "¼ teaspoon pepper", "3 tablespoons olive oil"], "instructions": "Pour 1 1/2 cups water, orange juice, lemon juice, rice vinegar, and soy sauce into a saucepan and set over medium-high heat. Stir in the orange zest, brown sugar, ginger, garlic, chopped onion, and red pepper flakes. Bring to a boil. Remove from heat, and cool 10 to 15 minutes.\n\nPlace the chicken pieces into a resealable plastic bag. When contents of saucepan have cooled, pour 1 cup of sauce into bag. Reserve the remaining sauce. Seal the bag, and refrigerate at least 2 hours.\n\nIn another resealable plastic bag, mix the flour, salt, and pepper. Add the marinated chicken pieces, seal the bag, and shake to coat.\n\nHeat the olive oil in a large skillet over medium heat. Place chicken into the skillet, and brown on both sides. Drain on a plate lined with paper towels, and cover with aluminum foil.\n\nWipe out the skillet, and add the sauce. Bring to a boil over medium-high heat. Mix together the cornstarch and 2 tablespoons water; stir into the sauce. Reduce heat to medium low, add the chicken pieces, and simmer, about 5 minutes, stirring occasionally.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3864686.jpg"}, {"title": "Homemade Flour Tortillas", "total_time": 60, "yields": "2 dozen", "ingredients": ["4 cups all-purpose flour", "1 teaspoon salt", "2 teaspoons baking powder", "2 tablespoons lard", "1 ½ cups water"], "instructions": "Whisk the flour, salt, and baking powder together in a mixing bowl. Mix in the lard with your fingers until the flour resembles cornmeal. Add the water and mix until the dough comes together; place on a lightly floured surface and knead a few minutes until smooth and elastic. Divide the dough into 24 equal pieces and roll each piece into a ball.\nPreheat a large skillet over medium-high heat. Use a well-floured rolling pin to roll a dough ball into a thin, round tortilla. Place into the hot skillet, and cook until bubbly and golden; flip and continue cooking until golden on the other side. Place the cooked tortilla in a tortilla warmer; continue rolling and cooking the remaining dough.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F663757.jpg"}, {"title": "Naan", "total_time": 180, "yields": "None", "ingredients": ["1 (.25 ounce) package active dry yeast", "1 cup warm water", "¼ cup white sugar", "3 tablespoons milk", "1 egg, beaten", "2 teaspoons salt", "4 ½ cups bread flour", "2 teaspoons minced garlic (optional)", "¼ cup butter, melted"], "instructions": "In a large bowl, dissolve yeast in warm water. Let stand about 10 minutes, until frothy. Stir in sugar, milk, egg, salt, and enough flour to make a soft dough. Knead for 6 to 8 minutes on a lightly floured surface, or until smooth. Place dough in a well oiled bowl, cover with a damp cloth, and set aside to rise. Let it rise 1 hour, until the dough has doubled in volume.\nPunch down dough, and knead in garlic. Pinch off small handfuls of dough about the size of a golf ball. Roll into balls, and place on a tray. Cover with a towel, and allow to rise until doubled in size, about 30 minutes.\nDuring the second rising, preheat grill to high heat.\nAt grill side, roll one ball of dough out into a thin circle. Lightly oil grill. Place dough on grill, and cook for 2 to 3 minutes, or until puffy and lightly browned. Brush uncooked side with butter, and turn over. Brush cooked side with butter, and cook until browned, another 2 to 4 minutes. Remove from grill, and continue the process until all the naan has been prepared.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1016308.jpg"}, {"title": "Chef John's Buttermilk Biscuits", "total_time": 35, "yields": "12 biscuits", "ingredients": ["2 cups all-purpose flour", "2 teaspoons baking powder", "1 teaspoon salt", "¼ teaspoon baking soda", "7 tablespoons unsalted butter, chilled in freezer and cut into thin slices", "¾ cup cold buttermilk", "2 tablespoons buttermilk for brushing"], "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nLine a baking sheet with a silicone baking mat or parchment paper.\nWhisk flour, baking powder, salt, and baking soda together in a large bowl.\nCut butter into flour mixture with a pastry blender until the mixture resembles coarse crumbs, about 5 minutes.\nMake a well in the center of butter and flour mixture. Pour in 3/4 cup buttermilk; stir until just combined.\nTurn dough onto a floured work surface, pat together into a rectangle.\nFold the rectangle in thirds. Turn dough a half turn, gather any crumbs, and flatten back into a rectangle. Repeat twice more, folding and pressing dough a total of three times.\nRoll dough on a floured surface to about 1/2 inch thick.\nCut out 12 biscuits using a 2 1/2-inch round biscuit cutter.\nTransfer biscuits to the prepared baking sheet. Press an indent into the top of each biscuit with your thumb.\nBrush the tops of biscuits with 2 tablespoons buttermilk.\nBake in the preheated oven until browned, about 15 minutes.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5909221.jpg"}, {"title": "Mexican Shredded Chuck Roast", "total_time": 190, "yields": "None", "ingredients": ["1 (3 pound) beef chuck roast", "salt and ground black pepper to taste", "2 tablespoons grapeseed oil", "1 large onion, diced", "4 cloves garlic, minced", "1 (14 ounce) can beef broth, divided", "1 (12 ounce) bottle Mexican guajillo red chile cooking sauce (such as Herdez&reg;)", "3 bay leaves"], "instructions": "Preheat the oven to 325 degrees F (165 degrees C).\nCut chuck roast into 3-inch cubes, removing excess fat and connective tissue. Season beef with salt and pepper.\nHeat grapeseed oil in a large Dutch oven over high heat. Sear cubes of beef a few at a time, until well browned on all sides, about 4 minutes per batch. Reserve browned beef in a bowl. Reduce heat to medium and add onion and garlic. Cook until soft and just beginning to brown, about 10 minutes.\nAdd 1 cup beef broth to onion mixture and stir well; simmer for 1 to 2 minutes. Add beef and pour in guajillo sauce. Add a little beef broth to the empty jar, seal, and shake to release remaining sauce; pour over the beef. Pour in enough of the remaining broth to just cover the beef. Add bay leaves and bring to a gentle simmer.\nBake in the preheated oven, covered, until beef is fork-tender, about 2 1/2 hours.\nRemove beef from sauce and set aside; discard bay leaves. Skim off excess fat from the top of the cooking liquid and bring to a boil to reduce slightly. Shred beef with two forks and return to cooking sauce.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1003804.jpg"}, {"title": "Easy Southern Biscuits", "total_time": 35, "yields": "None", "ingredients": ["2 cups self-rising flour", "2 tablespoons white sugar", "1 cup milk", "⅓ cup mayonnaise"], "instructions": "Preheat oven to 350 degrees F (175 degrees C).  Line 10 muffin cups with paper muffin liners.\nIn a large bowl, combine self-rising flour and sugar. Stir in milk and mayonnaise until a smooth dough is formed. Spoon batter into prepared muffin cups.\nBake in preheated oven for 25 to 30 minutes, until golden brown and doubled in size.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1749046.jpg"}, {"title": "Quick Black Bean Chilaquiles", "total_time": 30, "yields": "6 serving(s)", "ingredients": ["1 tablespoon vegetable oil", "1 onion, chopped", "4 cups tortilla chips", "6 large eggs", "1 (15 ounce) can black beans, rinsed and drained", "2 cups chipotle salsa", "1/2 cup crumbled queso fresco", "1/4 cup diced red onion", "1 avocado, sliced", "2 tablespoons chopped fresh cilantro"], "instructions": "Heat oil in a large skillet over medium-high heat until it shimmers. Add chopped onion and cook until it softens slightly, about 5 minutes. Add tortilla chips. Add eggs to the pan and stir around with the chips until almost set, 3 to 4 minutes. Pour in black beans and salsa. Stir to combine and heat through, about 5 minutes.\nTop chilaquiles with queso fresco, red onion, avocado, and cilantro. Serve immediately.", "image": "https://images.media-allrecipes.com/userphotos/560x315/8136154.jpg"}, {"title": "Grandma's Apple Dumplings", "total_time": 45, "yields": "8 serving(s)", "ingredients": ["2 Granny Smith apples - peeled, cored and quartered", "1 (8 ounce) can refrigerated crescent rolls", "1/8 teaspoon ground cinnamon", "1/2 cup butter", "3/4 cup white sugar", "1 cup orange juice", "1 teaspoon vanilla extract"], "instructions": "Preheat oven to 350 degrees F (175 degrees C). Wrap each apple piece in one crescent roll. Place seam side down in an 8x8 baking dish and sprinkle with cinnamon.\nIn medium saucepan, combine butter, sugar, and orange juice; bring to a boil. Remove from heat and stir in vanilla. Pour over rolls.\nBake for 30 minutes, or until pastry is golden and apples are tender. Spoon sauce over rolls when serving.", "image": "https://images.media-allrecipes.com/userphotos/560x315/1818974.jpg"}, {"title": "Grilled Salmon I", "total_time": 151, "yields": "6 serving(s)", "ingredients": ["1 1/2 pounds salmon fillets", "lemon pepper to taste", "garlic powder to taste", "salt to taste", "1/3 cup soy sauce", "1/3 cup brown sugar", "1/3 cup water", "1/4 cup vegetable oil"], "instructions": "Season salmon fillets with lemon pepper, garlic powder, and salt.\nIn a small bowl, stir together soy sauce, brown sugar, water, and vegetable oil until sugar is dissolved. Place fish in a large resealable plastic bag with the soy sauce mixture, seal, and turn to coat. Refrigerate for at least 2 hours.\nPreheat grill for medium heat.\nLightly oil grill grate. Place salmon on the preheated grill, and discard marinade. Cook salmon for 6 to 8 minutes per side, or until the fish flakes easily with a fork.", "image": "https://images.media-allrecipes.com/userphotos/560x315/800839.jpg"}, {"title": "Cheesy Amish Breakfast Casserole", "total_time": 75, "yields": "1 9x13-inch casserole", "ingredients": ["1 pound sliced bacon, diced", "1 sweet onion, chopped", "4 cups frozen shredded hash brown potatoes, thawed", "9 eggs, lightly beaten", "2 cups shredded Cheddar cheese", "1 ½ cups small curd cottage cheese", "1 ¼ cups shredded Swiss cheese"], "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nHeat a large skillet over medium-high heat; cook and stir bacon and onion until bacon is evenly browned, about 10 minutes. Drain. Transfer bacon and onion to a large bowl. Stir in potatoes, eggs, Cheddar cheese, cottage cheese, and Swiss cheese. Pour mixture into prepared baking dish.\nBake in preheated oven until eggs are set and cheese is melted, 45 to 50 minutes. Let stand 10 minutes before cutting and serving.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8087783.jpg"}, {"title": "Mexican Taco Meatloaf", "total_time": 60, "yields": "1 loaf", "ingredients": ["1 ½ pounds lean ground beef", "1 cup crushed tortilla chips", "¾ cup shredded pepper Jack cheese", "1 small onion, chopped", "1 (1 ounce) packet taco seasoning mix", "2 eggs, beaten", "½ cup milk", "¼ cup mild red taco sauce, or more to taste"], "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nThoroughly combine beef, tortilla chips, pepper Jack cheese, onion, and taco seasoning in a bowl.\nWhisk eggs, milk, and taco sauce together in a separate bowl. Add to meat mixture and stir until well combined.\nPress mixture into a 9x5-inch loaf pan and top with a strip of taco sauce down the center.\nBake in the preheated oven until cooked through and browned on top, 45 to 60 minutes.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7245693.jpg"}, {"title": "Mongolian Beef and Spring Onions", "total_time": 30, "yields": "None", "ingredients": ["2 teaspoons vegetable oil", "1 tablespoon finely chopped garlic", "½ teaspoon grated fresh ginger root", "½ cup soy sauce", "½ cup water", "⅔ cup dark brown sugar", "1 pound beef flank steak, sliced 1/4 inch thick on the diagonal", "¼ cup cornstarch", "1 cup vegetable oil for frying", "2 bunches green onions, cut in 2-inch lengths"], "instructions": "Heat 2 teaspoons of vegetable oil in a saucepan over medium heat, and cook and stir the garlic and ginger until they release their fragrance, about 30 seconds. Pour in the soy sauce, water, and brown sugar. Raise the heat to medium-high, and stir 4 minutes, until the sugar has dissolved and the sauce boils and slightly thickens. Remove sauce from the heat, and set aside.\nPlace the sliced beef into a bowl, and stir the cornstarch into the beef, coating it thoroughly. Allow the beef and cornstarch to sit until most of the juices from the meat have been absorbed by the cornstarch, about 10 minutes.\nHeat the vegetable oil in a deep-sided skillet or wok to 375 degrees F (190 degrees C).\nShake excess cornstarch from the beef slices, and drop them into the hot oil, a few at a time. Stir briefly, and fry until the edges become crisp and start to brown, about 2 minutes. Remove the beef from the oil with a large slotted spoon, and allow to drain on paper towels to remove excess oil.\nPour the oil out of the skillet or wok, and return the pan to medium heat. Return the beef slices to the pan, stir briefly, and pour in the reserved sauce. Stir once or twice to combine, and add the green onions. Bring the mixture to a boil, and cook until the onions have softened and turned bright green, about 2 minutes.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3189150.jpg"}, {"title": "Thai Peanut Chicken", "total_time": 0, "yields": "8 servings", "ingredients": ["2 cups uncooked white rice", "4 cups water", "3 tablespoons soy sauce", "2 tablespoons creamy peanut butter", "2 teaspoons white wine vinegar", "¼ teaspoon cayenne pepper", "3 tablespoons olive oil", "4 skinless, boneless chicken breast halves - cut into thin strips", "3 tablespoons chopped garlic", "1 ½ tablespoons chopped fresh ginger root", "¾ cup chopped green onions", "2 ½ cups broccoli florets", "⅓ cup unsalted dry-roasted peanuts"], "instructions": "Combine the rice and water in a saucepan over medium-high heat. Bring to a boil, then reduce heat to low, cover, and simmer for 20 minutes, or until rice is tender. In a small bowl, stir together the soy sauce, peanut butter, vinegar, and cayenne pepper. Set aside.\n\nHeat oil in a skillet or wok over high heat. Add chicken, garlic and ginger, and cook, stirring constantly, until chicken is golden on the outside, about 5 minutes.\n\nReduce heat to medium, and add green onion, broccoli, peanuts, and the peanut butter mixture. Cook, stirring frequently, for 5 minutes, or until broccoli is tender, and chicken is cooked through. Serve over rice.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3314.jpg"}, {"title": "Quick and Easy Pizza Crust", "total_time": 30, "yields": "8 serving(s)", "ingredients": ["1 (.25 ounce) package active dry yeast", "1 teaspoon white sugar", "1 cup warm water (110 degrees F/45 degrees C)", "2 1/2 cups bread flour", "2 tablespoons olive oil", "1 teaspoon salt"], "instructions": "Preheat oven to 450 degrees F (230 degrees C). In a medium bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes.\nStir in flour, salt and oil. Beat until smooth. Let rest for 5 minutes.\nTurn dough out onto a lightly floured surface and pat or roll into a round. Transfer crust to a lightly greased pizza pan or baker's peel dusted with cornmeal. Spread with desired toppings and bake in preheated oven for 15 to 20 minutes, or until golden brown. Let baked pizza cool for 5 minutes before serving.", "image": "https://images.media-allrecipes.com/userphotos/560x315/4542862.jpg"}, {"title": "Slow Cooker London Broil", "total_time": 610, "yields": "None", "ingredients": ["2 pounds flank steak", "1 (10.75 ounce) can condensed cream of mushroom soup", "1 (10.75 ounce) can condensed tomato soup", "1 (1 ounce) package dry onion soup mix"], "instructions": "Place meat in the bottom of the slow cooker; if necessary, slice meat to make it fit!\nIn a medium bowl, mix together mushroom and tomato soup. Pour mixture over beef. Sprinkle dry onion soup mix over top.\nCover, and cook on Low for 8 to 10 hours.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F111182.jpg"}, {"title": "Joy's Easy Banana Bread", "total_time": 75, "yields": "1 9x5-inch loaf", "ingredients": ["3 ripe bananas, mashed", "1 cup white sugar", "1 egg", "¼ cup melted butter", "1 ½ cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt"], "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan.\nCombine bananas, sugar, egg, and butter together in a bowl. Mix flour and baking soda together in a separate bowl; stir into banana mixture until batter is just mixed. Stir salt into batter. Pour batter into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted in the center of the bread comes out clean, about 1 hour.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2226688.jpg"}, {"title": "Tater Tot Taco Casserole", "total_time": 75, "yields": "None", "ingredients": ["1 pound ground beef", "1 small onion, diced", "1 clove garlic, minced", "1 (1 ounce) packet taco seasoning mix", "1 (16 ounce) bag frozen Mexican-style corn", "1 (12 ounce) can black beans, rinsed and drained", "1 (12 ounce) bag shredded Mexican cheese blend", "1 (16 ounce) package frozen tater tots", "1 (12 fluid ounce) can enchilada sauce"], "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Prepare a 9x13-inch baking dish with cooking spray.\nCook the ground beef in a skillet over medium heat until completely browned, 5 to 7 minutes. Add the onion, garlic, taco seasoning mix, frozen Mexican-style corn, and black beans to the ground beef; cook and stir another 10 minutes. Set aside to cool slightly.\nCombine the ground beef mixture in a large bowl with about 3/4 of the Mexican cheese blend and the tater tots; stir to combine.\nPour about 1/3 of the enchilada sauce into the bottom of the prepared baking dish. Add the tater tot mixture to the baking dish; lightly pat the mixture down into a solid, even layer. Pour the remaining enchilada sauce over the tater tot layer.\nBake in the preheated oven for 40 minutes. Sprinkle the remaining Mexican cheese over the casserole and return to oven until the cheese is melted and bubbly, about 5 minutes more.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7425369.jpg"}, {"title": "Hamburger Steak with Onions and Gravy", "total_time": 40, "yields": "None", "ingredients": ["1 pound ground beef", "1 egg", "¼ cup bread crumbs", "⅛ teaspoon ground black pepper", "½ teaspoon seasoned salt", "½ teaspoon onion powder", "½ teaspoon garlic powder", "1 teaspoon Worcestershire sauce", "1 tablespoon vegetable oil", "1 cup thinly sliced onion", "2 tablespoons all-purpose flour", "1 cup beef broth", "1 tablespoon cooking sherry", "½ teaspoon seasoned salt"], "instructions": "In a large bowl, mix together the ground beef, egg, bread crumbs, pepper, salt, onion powder, garlic powder, and Worcestershire sauce. Form into 8 balls, and flatten into patties.\nHeat the oil in a large skillet over medium heat. Fry the patties and onion in the oil until patties are nicely browned, about 4 minutes per side. Remove the beef patties to a plate, and keep warm.\nSprinkle flour over the onions and drippings in the skillet. Stir in flour with a fork, scraping bits of beef off of the bottom as you stir. Gradually mix in the beef broth and sherry. Season with seasoned salt. Simmer and stir over medium-low heat for about 5 minutes, until the gravy thickens. Turn heat to low, return patties to the gravy, cover, and simmer for another 15 minutes.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5938981.jpg"}, {"title": "Soft Oatmeal Cookies", "total_time": 120, "yields": "2 dozen", "ingredients": ["1 cup butter, softened", "1 cup white sugar", "1 cup packed brown sugar", "2 eggs", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 ½ teaspoons ground cinnamon", "3 cups quick cooking oats"], "instructions": "In a medium bowl, cream together butter, white sugar, and brown sugar. Beat in eggs one at a time, then stir in vanilla. Combine flour, baking soda, salt, and cinnamon; stir into the creamed mixture. Mix in oats. Cover, and chill dough for at least one hour.\nPreheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. Roll the dough into walnut sized balls, and place 2 inches apart on cookie sheets. Flatten each cookie with a large fork dipped in sugar.\nBake for 8 to 10 minutes in preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3779973.jpg"}, {"title": "Chicken Cordon Bleu II", "total_time": 0, "yields": "6 servings", "ingredients": ["6 skinless, boneless chicken breast halves", "6 slices Swiss cheese", "6 slices ham", "3 tablespoons all-purpose flour", "1 teaspoon paprika", "6 tablespoons butter", "½ cup dry white wine", "1 teaspoon chicken bouillon granules", "1 tablespoon cornstarch", "1 cup heavy whipping cream"], "instructions": "Pound chicken breasts if they are too thick. Place a cheese and ham slice on each breast within 1/2 inch of the edges. Fold the edges of the chicken over the filling, and secure with toothpicks. Mix the flour and paprika in a small bowl, and coat the chicken pieces.\n\nHeat the butter in a large skillet over medium-high heat, and cook the chicken until browned on all sides. Add the wine and bouillon. Reduce heat to low, cover, and simmer for 30 minutes, until chicken is no longer pink and juices run clear.\n\nRemove the toothpicks, and transfer the breasts to a warm platter. Blend the cornstarch with the cream in a small bowl, and whisk slowly into the skillet. Cook, stirring until thickened, and pour over the chicken. Serve warm.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4535588.jpg"}, {"title": "Churros", "total_time": 20, "yields": "None", "ingredients": ["1 cup water", "2 ½ tablespoons white sugar", "½ teaspoon salt", "2 tablespoons vegetable oil", "1 cup all-purpose flour", "2 quarts oil for frying", "½ cup white sugar, or to taste", "1 teaspoon ground cinnamon"], "instructions": "In a small saucepan over medium heat, combine water, 2 1/2 tablespoons sugar, salt and 2 tablespoons vegetable oil. Bring to a boil and remove from heat. Stir in flour until mixture forms a ball.\nHeat oil for frying in a deep fryer or deep pot to 375 degrees F (190 degrees C). Pipe 5- to 6-inch strips of dough into the hot oil using a sturdy pastry bag fitted with a medium star tip. Do not overcrowd the oil. Fry until golden; drain on paper towels.\nCombine 1/2 cup sugar and cinnamon. Roll drained churros in cinnamon and sugar mixture.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F392145.jpg"}, {"title": "One Bowl Chocolate Cake III", "total_time": 60, "yields": "2 - 9 inch round cake layers", "ingredients": ["2 cups white sugar", "1 ¾ cups all-purpose flour", "¾ cup unsweetened cocoa powder", "1 ½ teaspoons baking powder", "1 ½ teaspoons baking soda", "1 teaspoon salt", "2 eggs", "1 cup milk", "½ cup vegetable oil", "2 teaspoons vanilla extract", "1 cup boiling water"], "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two nine inch round pans.\nIn a large bowl, stir together the sugar, flour, cocoa, baking powder, baking soda and salt. Add the eggs, milk, oil and vanilla, mix for 2 minutes on medium speed of mixer. Stir in the boiling water last. Batter will be thin. Pour evenly into the prepared pans.\nBake 30 to 35 minutes in the preheated oven, until the cake tests done with a toothpick. Cool in the pans for 10 minutes, then remove to a wire rack to cool completely.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F708879.jpg"}, {"title": "Honey-Dijon Chicken Tenders", "total_time": 20, "yields": "4 serving(s)", "ingredients": ["1/2 cup all-purpose flour, or as needed", "3 tablespoons honey", "3 tablespoons Dijon mustard", "1/2 cup Italian-seasoned bread crumbs, or more as needed", "1 pound chicken tenders", "1/2 teaspoon salt", "1/4 teaspoon ground black pepper", "3 tablespoons butter"], "instructions": "Place flour in a shallow dish. Mix honey and Dijon mustard in another shallow dish. Place bread crumbs in a third shallow dish.\nSeason chicken tenders with salt and pepper. Coat with flour then dip into honey-mustard mixture, and finally into the bread crumbs, pressing bread crumbs into chicken.\nMelt 2 tablespoons butter in a large skillet. Cook chicken until golden brown, 4 to 5 minutes. Carefully turn tenders over, add remaining 1 tablespoon butter, and cook until chicken is fully cooked and golden brown, an additional 2 to 3 minutes.", "image": "https://images.media-allrecipes.com/userphotos/560x315/7949109.jpg"}, {"title": "Best Big, Fat, Chewy Chocolate Chip Cookie", "total_time": 40, "yields": "1 1/2 dozen", "ingredients": ["2 cups all-purpose flour", "½ teaspoon baking soda", "½ teaspoon salt", "¾ cup unsalted butter, melted", "1 cup packed brown sugar", "½ cup white sugar", "1 tablespoon vanilla extract", "1 egg", "1 egg yolk", "2 cups semisweet chocolate chips"], "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets or line with parchment paper.\nSift together the flour, baking soda and salt; set aside.\nIn a medium bowl, cream together the melted butter, brown sugar and white sugar until well blended. Beat in the vanilla, egg, and egg yolk until light and creamy. Mix in the sifted ingredients until just blended. Stir in the chocolate chips by hand using a wooden spoon. Drop cookie dough 1/4 cup at a time onto the prepared cookie sheets. Cookies should be about 3 inches apart.\nBake for 15 to 17 minutes in the preheated oven, or until the edges are lightly toasted. Cool on baking sheets for a few minutes before transferring to wire racks to cool completely.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1107530.jpg"}, {"title": "Apple Pie by Grandma Ople", "total_time": 90, "yields": "1 - 9 inch pie", "ingredients": ["1 recipe pastry for a 9 inch double crust pie", "½ cup unsalted butter", "3 tablespoons all-purpose flour", "¼ cup water", "½ cup white sugar", "½ cup packed brown sugar", "8 Granny Smith apples - peeled, cored and sliced"], "instructions": "Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.\nPlace the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust.  Gently pour the sugar and butter liquid over the crust.  Pour slowly so that it does not run off.\nBake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F736203.jpg"}, {"title": "One Pan Orecchiette Pasta", "total_time": 40, "yields": "2 serving(s)", "ingredients": ["2 tablespoons olive oil", "1/2 onion, diced", "salt to taste", "8 ounces spicy Italian sausages, casings removed", "3 1/2 cups low-sodium chicken broth, divided, or as needed", "1 1/4 cups orecchiette pasta, or more to taste", "1/2 cup roughly chopped arugula, or to taste", "1/4 cup finely grated Parmigiano-Reggiano cheese, or to taste"], "instructions": "Heat olive oil in a large, deep skillet over medium heat. Cook and stir onion with a pinch of salt in hot oil until onion is soft and golden, 5 to 7 minutes. Stir sausage into onions; cook and stir until sausage is broken up and browned, 5 to 7 minutes.\nPour 1 1/2 cups chicken broth into sausage mixture and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add orecchiette pasta; cook and stir pasta in hot broth, adding remaining broth when liquid is absorbed, until pasta is cooked through and most of the broth is absorbed, about 15 minutes.\nStir arugula into pasta-sausage mixture until arugula wilts. Ladle pasta into bowls and dust with Parmigiano-Reggiano cheese.", "image": "https://images.media-allrecipes.com/userphotos/560x315/4541124.jpg"}, {"title": "Easy Mexican Casserole", "total_time": 50, "yields": "None", "ingredients": ["1 pound lean ground beef", "2 cups salsa", "1 (16 ounce) can chili beans, drained", "3 cups tortilla chips, crushed", "2 cups sour cream", "1 (2 ounce) can sliced black olives, drained", "½ cup chopped green onion", "½ cup chopped fresh tomato", "2 cups shredded Cheddar cheese"], "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large skillet over medium-high heat, cook ground beef until no longer pink. Stir in salsa, reduce heat, and simmer 20 minutes, or until liquid is absorbed. Stir in beans, and heat through.\nSpray a 9x13 baking dish with cooking spray. Spread crushed tortilla chips in dish, and then spoon beef mixture over chips. Spread sour cream over beef, and sprinkle olives, green onion, and tomato over the sour cream. Top with Cheddar cheese.\nBake in preheated oven for 30 minutes, or until hot and bubbly.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5670908.jpg"}, {"title": "General Tsao's Chicken II", "total_time": 0, "yields": "6 servings", "ingredients": ["4 cups vegetable oil for frying", "1 egg", "1 ½ pounds boneless, skinless chicken thighs, cut into 1/2 inch cubes", "1 teaspoon salt", "1 teaspoon white sugar", "1 pinch white pepper", "1 cup cornstarch", "2 tablespoons vegetable oil", "3 tablespoons chopped green onion", "1 clove garlic, minced", "6 dried whole red chilies", "1 strip orange zest", "½ cup white sugar", "¼ teaspoon ground ginger", "3 tablespoons chicken broth", "1 tablespoon rice vinegar", "¼ cup soy sauce", "2 teaspoons sesame oil", "2 tablespoons peanut oil", "2 teaspoons cornstarch", "¼ cup water"], "instructions": "Heat 4 cups vegetable oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\n\nBeat the egg in a mixing bowl. Add the chicken cubes; sprinkle with salt, 1 teaspoon sugar, and white pepper; mix well. Mix in 1 cup of cornstarch a little bit at a time until the chicken cubes are well coated.\n\nIn batches, carefully drop the chicken cubes into the hot oil one by one, cooking until they turns golden brown and begin to float, about 3 minutes. Remove the chicken and allow to cool as you fry the next batch. Once all of the chicken has been fried, refry the chicken, starting with the batch that was cooked first. Cook until the chicken turns deep golden brown, about 2 minutes more. Drain on a paper towel-lined plate.\n\nHeat 2 tablespoons vegetable oil in a wok or large skillet over high heat. Stir in the green onion, garlic, whole chiles, and orange zest. Cook and stir a minute or two until the garlic has turned golden and the chiles brighten. Add 1/2 cup sugar, the ginger, chicken broth, vinegar, soy sauce, sesame oil, and peanut oil; bring to a boil and cook for 3 minutes.\n\nDissolve 2 teaspoons of cornstarch into the water, and stir into the boiling sauce. Return to a boil and cook until the sauce thickens and is no longer cloudy from the cornstarch, about 1 minute. Stir the chicken into the boiling sauce. Reduce heat to low and cook for a few minutes until the chicken absorbs some of the sauce.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4477872.jpg"}, {"title": "Creamy Au Gratin Potatoes", "total_time": 120, "yields": "None", "ingredients": ["4 russet potatoes, sliced into 1/4 inch slices", "1 onion, sliced into rings", "salt and pepper to taste", "3 tablespoons butter", "3 tablespoons all-purpose flour", "½ teaspoon salt", "2 cups milk", "1 ½ cups shredded Cheddar cheese"], "instructions": "Preheat oven to 400 degrees F (200 degrees C). Butter a medium casserole dish.\nLayer 1/2 of the potatoes into bottom of the prepared casserole dish. Top with the onion slices, and add the remaining potatoes. Season with salt and pepper to taste.\nIn a medium-size saucepan, melt butter over medium heat. Mix in the flour and salt, and stir constantly with a whisk for one minute. Stir in milk. Cook until mixture has thickened. Stir in cheese all at once, and continue stirring until melted, about 30 to 60 seconds. Pour cheese over the potatoes, and cover the dish with aluminum foil.\nBake 1 1/2 hours in the preheated oven.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F738814.jpg"}, {"title": "Garlic Chicken", "total_time": 0, "yields": "4 servings", "ingredients": ["¼ cup olive oil", "2 cloves garlic, crushed", "¼ cup Italian-seasoned bread crumbs", "¼ cup grated Parmesan cheese", "4 skinless, boneless chicken breast halves"], "instructions": "Preheat oven to 425 degrees F (220 degrees C).\n\nHeat olive oil and garlic in a small saucepan over low heat until warmed, 1 to 2 minutes. Transfer garlic and oil to a shallow bowl.\n\nCombine bread crumbs and Parmesan cheese in a separate shallow bowl.\n\nDip chicken breasts in the olive oil-garlic mixture using tongs; transfer to bread crumb mixture and turn to evenly coat. Transfer coated chicken to a shallow baking dish.\n\nBake in the preheated oven until no longer pink and juices run clear, 30 to 35 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4562452.jpg"}, {"title": "Alfredo Sauce", "total_time": 20, "yields": "None", "ingredients": ["¼ cup butter", "1 cup heavy cream", "1 clove garlic, crushed", "1 ½ cups freshly grated Parmesan cheese", "¼ cup chopped fresh parsley"], "instructions": "Melt butter in a medium saucepan over medium low heat. Add cream and simmer for 5 minutes, then add garlic and cheese and whisk quickly, heating through. Stir in parsley and serve.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F672690.jpg"}, {"title": "Chef John's Italian Meatballs", "total_time": 135, "yields": "30 meatballs", "ingredients": ["⅓ cup plain bread crumbs", "½ cup milk", "2 tablespoons olive oil", "1 onion, diced", "1 pound ground beef", "1 pound ground pork", "2 eggs", "¼ bunch fresh parsley, chopped", "3 cloves garlic, crushed", "2 teaspoons salt", "1 teaspoon ground black pepper", "½ teaspoon red pepper flakes", "1 teaspoon dried Italian herb seasoning", "2 tablespoons grated Parmesan cheese"], "instructions": "Cover a baking sheet with foil and spray lightly with cooking spray.\nSoak bread crumbs in milk in a small bowl for 20 minutes.\nHeat olive oil in a skillet over medium heat. Cook and stir onions in hot oil until translucent, about 20 minutes.\nMix beef and pork together in a large bowl. Stir onions, bread crumb mixture, eggs, parsley, garlic, salt, black pepper, red pepper flakes, Italian herb seasoning, and Parmesan cheese into meat mixture with a rubber spatula until combined. Cover and refrigerate for about one hour.\nPreheat an oven to 425 degrees F (220 degrees C).\nUsing wet hands, form meat mixture into balls about 1 1/2 inches in diameter. Arrange onto prepared baking sheet.\nBake in the preheated oven until browned and cooked through, 15 to 20 minutes.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4531471.jpg"}, {"title": "Oven-Roasted Asparagus", "total_time": 25, "yields": "None", "ingredients": ["1 bunch thin asparagus spears, trimmed", "3 tablespoons olive oil", "1 ½ tablespoons grated Parmesan cheese (optional)", "1 clove garlic, minced (optional)", "1 teaspoon sea salt", "½ teaspoon ground black pepper", "1 tablespoon lemon juice (optional)"], "instructions": "Preheat an oven to 425 degrees F (220 degrees C).\nPlace the asparagus into a mixing bowl, and drizzle with the olive oil. Toss to coat the spears, then sprinkle with Parmesan cheese, garlic, salt, and pepper. Arrange the asparagus onto a baking sheet in a single layer.\nBake in the preheated oven until just tender, 12 to 15 minutes depending on thickness. Sprinkle with lemon juice just before serving.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1001600.jpg"}, {"title": "Angela's Awesome Enchiladas", "total_time": 0, "yields": "5 enchiladas", "ingredients": ["2 pounds skinless, boneless chicken breast meat - cut into chunks", "1 (10.75 ounce) can condensed cream of chicken soup", "1 ¼ cups sour cream", "¼ teaspoon chili powder", "1 tablespoon butter", "1 small onion, chopped", "1 (4 ounce) can chopped green chilies, drained", "1 (1.25 ounce) package mild taco seasoning mix", "1 bunch green onions, chopped, divided", "1 cup water", "1 teaspoon lime juice", "½ teaspoon onion powder", "½ teaspoon garlic powder", "5 (12 inch) flour tortillas", "3 cups Cheddar cheese, shredded, divided", "1 (10 ounce) can enchilada sauce", "1 (6 ounce) can sliced black olives"], "instructions": "Place the chicken in a large pot and add water to cover. Bring to a boil over high heat, then reduce the heat to medium-low, cover, and simmer until the chicken pieces are no longer pink, about 10 minutes. Shred chicken by placing two forks back to back and pulling meat apart. Set the shredded chicken aside. Meanwhile, combine the cream of chicken soup, sour cream, and chili powder in a saucepan. Bring to a simmer over low heat, stirring occasionally, then turn off the heat and cover to keep warm.\n\nHeat the butter in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the shredded chicken, chopped green chilies, taco seasoning, half of the bunch of chopped green onion, and water. Allow to simmer for 10 minutes. Stir in the lime juice, onion powder, and garlic powder; simmer for an additional 10 minutes.\n\nPreheat an oven to 350 degrees F (175 degrees C). Stir 1 cup of the soup mixture into the skillet with the chicken mixture. Spread the remaining soup mixture on the bottom of a 9x13 inch baking dish.\n\nFill each tortilla with chicken mixture. Sprinkle Cheddar cheese over the chicken filling before folding the tortillas, reserving half of the shredded cheese for topping the enchiladas.  Fold tortillas over the filling and place seam-side down in the prepared pan.\n\nPour enchilada sauce evenly over the enchiladas. Cover with the remaining 1 1/2 cups of Cheddar cheese. Sprinkle the reserved chopped green onions and the sliced olives on top of the cheese. Bake in the preheated oven until filling is heated through and the cheese is melted and bubbling, about 25 minutes.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F683438.jpg"}, {"title": "Chicken Marsala", "total_time": 0, "yields": "4 servings", "ingredients": ["¼ cup all-purpose flour for coating", "½ teaspoon salt", "¼ teaspoon ground black pepper", "½ teaspoon dried oregano", "4 skinless, boneless chicken breast halves - pounded 1/4 inch thick", "4 tablespoons butter", "4 tablespoons olive oil", "1 cup sliced mushrooms", "½ cup Marsala wine", "¼ cup cooking sherry"], "instructions": "In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. Coat chicken pieces in flour mixture.\n\nIn a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown.  Turn over chicken pieces, and add mushrooms. Pour in wine and sherry.  Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5107151.jpg"}, {"title": "Quick and Almost-Professional Buttercream Icing", "total_time": 15, "yields": "8 serving(s)", "ingredients": ["1/2 cup unsalted butter, softened", "1 1/2 teaspoons vanilla extract", "2 cups confectioners' sugar, sifted", "2 tablespoons milk", "3 drops food coloring, or as needed (optional)"], "instructions": "Cream room temperature butter with a hand mixer, the paddle attachment of a stand mixer, or a wooden spoon until smooth and fluffy. Gradually beat in confectioners' sugar until fully incorporated. Beat in vanilla extract.\nPour in milk and beat for an additional 3-4 minutes. Add food coloring, if using, and beat for thirty seconds until smooth or until desired color is reached.", "image": "https://images.media-allrecipes.com/userphotos/560x315/572806.jpg"}, {"title": "Asian Lettuce Wraps", "total_time": 35, "yields": "None", "ingredients": ["16 Boston Bibb or butter lettuce leaves", "1 pound lean ground beef", "1 tablespoon cooking oil", "1 large onion, chopped", "¼ cup hoisin sauce", "2 cloves fresh garlic, minced", "1 tablespoon soy sauce", "1 tablespoon rice wine vinegar", "2 teaspoons minced pickled ginger", "1 dash Asian chile pepper sauce, or to taste (optional)", "1 (8 ounce) can water chestnuts, drained and finely chopped", "1 bunch green onions, chopped", "2 teaspoons Asian (dark) sesame oil"], "instructions": "Rinse whole lettuce leaves and pat dry, being careful not tear them. Set aside.\nHeat a large skillet over medium-high heat. Cook and stir beef and cooking oil in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease; transfer beef to a bowl. Cook and stir onion in the same skillet used for beef until slightly tender, 5 to 10 minutes. Stir hoisin sauce, garlic, soy sauce, vinegar, ginger, and chile pepper sauce into onions. Add water chestnuts, green onions, sesame oil, and cooked beef; cook and stir until the onions just begin to wilt, about 2 minutes.\nArrange lettuce leaves around the outer edge of a large serving platter and pile meat mixture in the center.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2630776.jpg"}, {"title": "Banana Chocolate Chip Bread", "total_time": 85, "yields": "1 9x5-inch loaf", "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "1 teaspoon salt", "3 ripe bananas, mashed", "1 tablespoon milk", "1 teaspoon ground cinnamon, or to taste", "½ cup butter, softened", "1 cup white sugar", "2 eggs", "1 cup semisweet chocolate chips"], "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan, preferably glass.\nMix flour, baking powder, baking soda, and salt in a bowl. Stir bananas, milk, and cinnamon in another bowl. Beat butter and sugar in a third bowl until light and fluffy. Add eggs to butter mixture, one at a time, beating well after each addition. Stir banana mixture into butter mixture. Stir in dry mixture until blended. Fold in chocolate chips until just combined. Pour batter into prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 70 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack before slicing.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4516795.jpg"}, {"title": "Tuna Melts", "total_time": 25, "yields": "None", "ingredients": ["1 (1 pound) loaf French bread", "1 small sweet onion, peeled and diced", "1 (12 ounce) can tuna, drained", "2 cups mozzarella cheese, shredded", "1 cup mayonnaise"], "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a mixing bowl, combine sweet onion, drained tuna, mozzarella, and mayonnaise. Mix thoroughly.\nSpread tuna mixture on slices of French bread to form a sandwich. Place sandwiches on a cookie sheet.\nBake in a preheated oven for 10 minutes.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F648053.jpg"}, {"title": "Classic Peanut Butter Cookies", "total_time": 85, "yields": "4 dozen", "ingredients": ["1 cup unsalted butter", "1 cup crunchy peanut butter", "1 cup white sugar", "1 cup packed brown sugar", "2 eggs", "2 ½ cups all-purpose flour", "1 teaspoon baking powder", "½ teaspoon salt", "1 ½ teaspoons baking soda"], "instructions": "Cream butter, peanut butter, and sugars together in a bowl; beat in eggs.\nIn a separate bowl, sift flour, baking powder, baking soda, and salt; stir into butter mixture. Put dough in refrigerator for 1 hour.\nRoll dough into 1 inch balls and put on baking sheets. Flatten each ball with a fork, making a crisscross pattern. Bake in a preheated 375 degrees F oven for about 10 minutes or until cookies begin to brown.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1078651.jpg"}, {"title": "Creamy Cajun Chicken Pasta", "total_time": 0, "yields": "2 servings", "ingredients": ["4 ounces linguine pasta", "2 boneless, skinless chicken breast halves, sliced into thin strips", "2 teaspoons Cajun seasoning", "2 tablespoons butter", "1 green bell pepper, chopped", "½ red bell pepper, chopped", "4 fresh mushrooms, sliced", "1 green onion, minced", "1 ½ cups heavy cream", "¼ teaspoon dried basil", "¼ teaspoon lemon pepper", "¼ teaspoon salt", "⅛ teaspoon garlic powder", "⅛ teaspoon ground black pepper", "2 tablespoons grated Parmesan cheese"], "instructions": "Bring a large pot of lightly salted water to a boil. Add linguini pasta, and cook for 8 to 10 minutes, or until al dente; drain.\n\nMeanwhile, place chicken and Cajun seasoning in a bowl, and toss to coat.\n\nIn a large skillet over medium heat, saute chicken in butter until no longer pink and juices run clear, about 5 to 7 minutes. Add green and red bell peppers, sliced mushrooms and green onions; cook for 2 to 3 minutes. Reduce heat, and stir in heavy cream. Season the sauce with basil, lemon pepper, salt, garlic powder and ground black pepper, and heat through.\n\nIn a large bowl, toss linguini with sauce. Sprinkle with grated Parmesan cheese.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4421034.jpg"}, {"title": "Better-Than-Olive Garden&reg; Alfredo Sauce", "total_time": 30, "yields": "None", "ingredients": ["3 tablespoons sweet butter", "2 tablespoons olive oil", "2 cups heavy whipping cream", "2 cloves garlic, minced", "¼ teaspoon ground white pepper", "½ cup grated Parmesan cheese", "¾ cup shredded mozzarella cheese", "1 (12 ounce) package angel hair pasta"], "instructions": "Melt butter and olive oil in a saucepan over medium-low heat. Add cream, garlic, and white pepper; bring to just under a boil. Reduce heat and simmer, stirring often, until mixture is slightly reduced, about 5 minutes.\nStir Parmesan cheese into cream mixture and simmer until sauce is thickened and smooth, 8 to 10 minutes. Add mozzarella cheese to sauce; cook and stir until cheese is melted, about 5 minutes.\nBring a large pot of lightly salted water to a boil. Cook angel hair in the boiling water, stirring occasionally until cooked through but firm to the bite, 3 to 5 minutes. Drain and transfer pasta to serving plates. Spoon sauce over pasta.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1192671.jpg"}, {"title": "Clone of a Cinnabon", "total_time": 180, "yields": "12 rolls", "ingredients": ["1 cup warm milk (110 degrees F/45 degrees C)", "2 eggs, room temperature", "⅓ cup margarine, melted", "4 ½ cups bread flour", "1 teaspoon salt", "½ cup white sugar", "2 ½ teaspoons bread machine yeast", "1 cup brown sugar, packed", "2 ½ tablespoons ground cinnamon", "⅓ cup butter, softened", "1 (3 ounce) package cream cheese, softened", "¼ cup butter, softened", "1 ½ cups confectioners' sugar", "½ teaspoon vanilla extract", "⅛ teaspoon salt"], "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select dough cycle; press Start.\nAfter the dough has doubled in size turn it out onto a lightly floured surface, cover and let rest for 10 minutes. In a small bowl, combine brown sugar and cinnamon.\nRoll dough into a 16x21-inch rectangle. Spread dough with 1/3 cup butter and sprinkle evenly with sugar/cinnamon mixture. Roll up dough and cut into 12 rolls. Place rolls in a lightly greased 9x13 inch baking pan. Cover and let rise until nearly doubled, about 30 minutes. Meanwhile, preheat oven to 400 degrees F (200 degrees C).\nBake rolls in preheated oven until golden brown, about 15 minutes. While rolls are baking, beat together cream cheese, 1/4 cup butter, confectioners' sugar, vanilla extract and salt. Spread frosting on warm rolls before serving.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F36449.jpg"}, {"title": "Sloppy Joes II", "total_time": 40, "yields": "None", "ingredients": ["1 pound lean ground beef", "¼ cup chopped onion", "¼ cup chopped green bell pepper", "½ teaspoon garlic powder", "1 teaspoon prepared yellow mustard", "¾ cup ketchup", "3 teaspoons brown sugar", "salt to taste", "ground black pepper to taste"], "instructions": "In a medium skillet over medium heat, brown the ground beef, onion, and green pepper; drain off liquids.\nStir in the garlic powder, mustard, ketchup, and brown sugar; mix thoroughly. Reduce heat, and simmer for 30 minutes. Season with salt and pepper.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F747244.jpg"}, {"title": "Best Steak Marinade in Existence", "total_time": 15, "yields": "8 serving(s)", "ingredients": ["1/3 cup soy sauce", "1/2 cup olive oil", "1/3 cup fresh lemon juice", "1/4 cup Worcestershire sauce", "1 1/2 tablespoons garlic powder", "3 tablespoons dried basil", "1 1/2 tablespoons dried parsley flakes", "1 teaspoon ground white pepper", "1/4 teaspoon hot pepper sauce (optional)", "1 teaspoon dried minced garlic (optional)"], "instructions": "Place the soy sauce, olive oil, lemon juice, Worcestershire sauce, garlic powder, basil, parsley, and pepper in a blender. Add hot pepper sauce and garlic, if desired. Blend on high speed for 30 seconds until thoroughly mixed.\nPour marinade over desired type of meat. Cover, and refrigerate for up to 8 hours. Cook meat as desired.", "image": "https://images.media-allrecipes.com/userphotos/560x315/4537368.jpg"}, {"title": "Baked Ziti I", "total_time": 55, "yields": "None", "ingredients": ["1 pound dry ziti pasta", "1 onion, chopped", "1 pound lean ground beef", "2 (26 ounce) jars spaghetti sauce", "6 ounces provolone cheese, sliced", "1 ½ cups sour cream", "6 ounces mozzarella cheese, shredded", "2 tablespoons grated Parmesan cheese"], "instructions": "Bring a large pot of lightly salted water to a boil. Add ziti pasta, and cook until al dente, about 8 minutes; drain.\nIn a large skillet, brown onion and ground beef over medium heat. Add spaghetti sauce, and simmer 15 minutes.\nPreheat the oven to 350 degrees F (175 degrees C). Butter a 9x13 inch baking dish. Layer as follows: 1/2 of the ziti, Provolone cheese, sour cream, 1/2 sauce mixture, remaining ziti, mozzarella cheese and remaining sauce mixture. Top with grated Parmesan cheese.\nBake for 30 minutes in the preheated oven, or until cheeses are melted.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4557541.jpg"}, {"title": "Grandma Rita's Soft Butter Rolls", "total_time": 115, "yields": "18 large rolls", "ingredients": ["¾ cup milk", "¼ cup butter", "¼ cup white sugar", "1 teaspoon salt", "4 ½ teaspoons active dry yeast", "1 teaspoon white sugar", "½ cup warm water (110 degrees F/45 degrees C)", "3 ½ cups bread flour, divided, or as needed", "1 egg, lightly beaten", "1 tablespoon all-purpose flour, or more as needed, for dusting"], "instructions": "Pour milk into a glass 2-cup measuring cup and heat in the microwave until it starts to boil and climb the sides, about 1 minute. Add butter, 1/4 cup sugar, and salt to the scalded milk; set aside to cool until it gets below 110 degrees F (45 degrees C).\nDissolve yeast and 1 teaspoon sugar in warm water in a large bowl. Let stand until the yeast softens and begins to form a creamy foam, about 10 minutes.\nPour milk mixture into the yeast mixture; add 2 cups bread flour and egg. Stir the mixture with a wooden spoon until smooth. Add remaining flour, 1/2 cup at a time, mixing thoroughly after each addition, until the dough is smooth and a little tacky.\nTurn dough out onto a sheet of flour-dusted waxed paper and lightly knead to pull dough together; shape into a ball. Place dough in a large, lightly-oiled bowl, and turn to coat. Cover with a towel and let rise in a warm place for about 30 minutes.\nLine a baking sheet with parchment paper. Divide dough into thirds. Break each third into six evenly sized balls and arrange onto prepared baking sheet. Cover balls with a towel to rise further for another 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until browned, about 15 minutes.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6918091.jpg"}, {"title": "Spicy Garlic Lime Chicken", "total_time": 25, "yields": "None", "ingredients": ["¾ teaspoon salt", "¼ teaspoon black pepper", "¼ teaspoon cayenne pepper", "⅛ teaspoon paprika", "¼ teaspoon garlic powder", "⅛ teaspoon onion powder", "¼ teaspoon dried thyme", "¼ teaspoon dried parsley", "4 boneless, skinless chicken breast halves", "2 tablespoons butter", "1 tablespoon olive oil", "2 teaspoons garlic powder", "3 tablespoons lime juice"], "instructions": "In a small bowl, mix together salt, black pepper, cayenne, paprika, 1/4 teaspoon garlic powder, onion powder, thyme and parsley. Sprinkle spice mixture generously on both sides of chicken breasts.\nHeat butter and olive oil in a large heavy skillet over medium heat. Saute chicken until golden brown, about 6 minutes on each side. Sprinkle with 2 teaspoons garlic powder and lime juice. Cook 5 minutes more, stirring frequently to coat evenly with sauce.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4873776.jpg"}, {"title": "Chef John's Stuffed Peppers", "total_time": 110, "yields": "None", "ingredients": ["1 cup uncooked long grain white rice", "2 cups water", "1 onion, diced", "1 tablespoon olive oil", "2 cups marinara sauce", "1 cup beef broth", "1 tablespoon balsamic vinegar", "¼ teaspoon crushed red pepper flakes", "1 pound lean ground beef", "¼ pound hot Italian pork sausage, casing removed", "1 (10 ounce) can diced tomatoes", "¼ cup chopped fresh Italian parsley", "4 cloves garlic, minced", "2 teaspoons salt", "1 teaspoon freshly ground black pepper", "1 pinch ground cayenne pepper", "4 large green bell peppers, halved lengthwise and seeded", "1 cup finely grated Parmigiano-Reggiano cheese, plus more for topping"], "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nBring rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Set the cooked rice aside.\nCook onion and olive oil over medium heat until onion begins to soften, about 5 minutes. Transfer half of cooked onion to a large bowl and set aside.\nStir marinara sauce, beef broth, balsamic vinegar, and red pepper flakes into the skillet; cook and stir for 1 minute.\nPour sauce mixture into a 9x13-inch baking dish and set aside.\nCombine ground beef, Italian sausage, diced tomatoes, Italian parsley, garlic, salt, black pepper, and cayenne pepper into bowl with reserved onions; mix well. Stir in cooked rice and Parmigiano Reggiano. Stuff green bell peppers with beef and sausage mixture.\nPlace stuffed green bell pepper halves in the baking dish over tomato sauce; sprinkle with remaining Parmigiano-Reggiano, cover baking dish with aluminum foil, and bake in the preheated oven for 45 minutes.\nRemove aluminum foil and bake until the meat is no longer pink, the green peppers are tender and the cheese is browned on top, an addition 20 to 25 minutes.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1415039.jpg"}, {"title": "Apple Crisp II", "total_time": 80, "yields": "12 serving(s)", "ingredients": ["10 cups all-purpose apples, peeled, cored and sliced", "1 cup white sugar", "1 tablespoon all-purpose flour", "1 teaspoon ground cinnamon", "1/2 cup water", "1 cup quick-cooking oats", "1 cup all-purpose flour", "1 cup packed brown sugar", "1/4 teaspoon baking powder", "1/4 teaspoon baking soda", "1/2 cup butter, melted"], "instructions": "Preheat oven to 350 degrees F (175 degree C).\nPlace the sliced apples in a 9x13 inch pan. Mix the white sugar, 1 tablespoon flour and ground cinnamon together, and sprinkle over apples. Pour water evenly over all.\nCombine the oats, 1 cup flour, brown sugar, baking powder, baking soda and melted butter together. Crumble evenly over the apple mixture.\nBake at 350 degrees F (175 degrees C) for about 45 minutes.", "image": "https://images.media-allrecipes.com/userphotos/560x315/277929.jpg"}, {"title": "Too Much Chocolate Cake", "total_time": 0, "yields": "1 12 cup Bundt cake", "ingredients": ["1 (18.25 ounce) package devil's food cake mix", "1 (5.9 ounce) package instant chocolate pudding mix", "1 cup sour cream", "1 cup vegetable oil", "4 eggs", "½ cup warm water", "2 cups semisweet chocolate chips"], "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together the cake and pudding mixes, sour cream, oil, beaten eggs and water.  Stir in the chocolate chips and pour batter into a well greased 12 cup bundt pan.\nBake for 50 to 55 minutes, or until top is springy to the touch and a wooden toothpick inserted comes out clean. Cool cake thoroughly in pan at least an hour and a half before inverting onto a plate  If desired, dust the cake with powdered sugar.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1130307.jpg"}, {"title": "Mendocino Chicken Salad", "total_time": 0, "yields": "6 servings", "ingredients": ["1 (6 ounce) package smoked chicken breast, skin removed, cubed", "1 cup seedless grapes, halved", "½ cup diced red onion", "3 stalks celery, diced", "¼ cup fresh basil leaves, cut into thin strips", "1 cup blanched slivered almonds", "¾ cup mayonnaise"], "instructions": "In a large bowl, combine the smoked chicken, grapes, red onion, celery, basil, almonds, and mayonnaise. Mix well; chill and serve.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3658944.jpg"}, {"title": "Quick Chicken Piccata", "total_time": 0, "yields": "4 servings", "ingredients": ["4 eaches skinless, boneless chicken breast halves", "1 pinch cayenne pepper, or to taste", "1 pinch salt and ground black pepper to taste", "¼ cup all-purpose flour for dredging", "2 tablespoons olive oil", "1 tablespoon capers, drained", "½ cup white wine", "¼ cup fresh lemon juice", "¼ cup water", "3 tablespoons cold unsalted butter, cut in 1/4-inch slices", "2 tablespoons fresh Italian parsley, chopped"], "instructions": "Place chicken breasts between 2 layers of plastic wrap and pound to about 1/2-inch thick.\n\nSeason both sides of chicken breasts with cayenne, salt, and black pepper; dredge lightly in flour and shake off any excess.\n\nHeat olive oil in a skillet over medium-high heat. Place chicken in the pan, reduce heat to medium, and cook until browned and cooked through, about 5 minutes per side; remove to a plate.\n\nCook capers in reserved oil, smashing them lightly to release brine, until warmed though, about 30 seconds.\n\nPour white wine into skillet. Scrape any browned bits from the bottom of the pan with a wooden spoon. Cook until reduced by half, about 2 minutes.\n\nStir lemon juice, water, and butter into the reduced wine mixture; cook and stir continuously to form a thick sauce, about 2 minutes. Reduce heat to low and stir parsley through the sauce.\n\nReturn chicken breasts to the pan cook until heated through, 1 to 2 minutes. Serve with sauce spooned over the top.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3067683.jpg"}, {"title": "Rosemary Ranch Chicken Kabobs", "total_time": 0, "yields": "6 servings", "ingredients": ["½ cup olive oil", "½ cup ranch dressing", "3 tablespoons Worcestershire sauce", "1 tablespoon minced fresh rosemary", "2 teaspoons salt", "1 teaspoon lemon juice", "1 teaspoon white vinegar", "¼ teaspoon ground black pepper, or to taste", "1 tablespoon white sugar, or to taste", "5 eaches skinless, boneless chicken breast halves - cut into 1 inch cubes"], "instructions": "In a medium bowl, stir together the olive oil, ranch dressing, Worcestershire sauce, rosemary, salt, lemon juice, white vinegar, pepper, and sugar.  Let stand for 5 minutes.  Place chicken in the bowl, and stir to coat with the marinade.  Cover and refrigerate for 30 minutes.\n\nPreheat the grill for medium-high heat.  Thread chicken onto skewers and discard marinade.\n\nLightly oil the grill grate.  Grill skewers for 8 to 12 minutes, or until the chicken is no longer pink in the center, and the juices run clear.\n", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F642001.jpg"}, {"title": "Mom's Zucchini Bread", "total_time": 100, "yields": "2 loaves", "ingredients": ["3 cups all-purpose flour", "1 teaspoon salt", "1 teaspoon baking soda", "1 teaspoon baking powder", "1 tablespoon ground cinnamon", "3 eggs", "1 cup vegetable oil", "2 ¼ cups white sugar", "3 teaspoons vanilla extract", "2 cups grated zucchini", "1 cup chopped walnuts"], "instructions": "Grease and flour two 8 x 4 inch pans.  Preheat oven to 325 degrees F (165 degrees C).\nSift flour, salt, baking powder, soda, and cinnamon together in a bowl.\nBeat eggs, oil, vanilla, and sugar together in a large bowl.  Add sifted ingredients to the creamed mixture, and beat well.  Stir in zucchini and nuts until well combined.  Pour batter into prepared pans.\nBake for 40 to 60 minutes, or until tester inserted in the center comes out clean.  Cool in pan on rack for 20 minutes.  Remove bread from pan, and completely cool.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1037957.jpg"}, {"title": "Fluffy French Toast", "total_time": 30, "yields": "12 serving(s)", "ingredients": ["1/4 cup all-purpose flour", "1 cup milk", "1 pinch salt", "3 eggs", "1/2 teaspoon ground cinnamon", "1 teaspoon vanilla extract", "1 tablespoon white sugar", "12 thick slices bread"], "instructions": "Measure flour into a large mixing bowl. Slowly whisk in the milk. Whisk in the salt, eggs, cinnamon, vanilla extract and sugar until smooth. Watch Now\nHeat a lightly oiled griddle or frying pan over medium heat. Watch Now\nSoak bread slices in mixture until saturated. Cook bread on each side until golden brown. Serve hot. Watch Now", "image": "https://images.media-allrecipes.com/userphotos/560x315/2049275.jpg"}, {"title": "Skillet-Braised Brussels Sprouts", "total_time": 40, "yields": "None", "ingredients": ["4 slices thick-cut bacon, sliced into 1/4-inch strips, or more to taste", "1 pound Brussels sprouts, trimmed and halved, or more to taste", "1 clove garlic, thinly sliced, or more to taste", "½ cup chicken stock, or more as needed", "1 tablespoon butter, or to taste", "1 tablespoon balsamic vinegar, or more to taste", "salt and ground black pepper to taste"], "instructions": "Place bacon in a large skillet over medium-low heat; cook until just crisp, about 10 minutes. Transfer bacon to a paper towel-lined plate, reserving bacon grease in skillet.\nIncrease heat to medium-high under skillet; saute Brussels sprouts in the bacon grease until lightly browned, 2 to 3 minutes. Add garlic to Brussels sprouts; saute until garlic is fragrant, 1 to 2 minutes.\nPour chicken stock over Brussels sprouts mixture and cover skillet with a lid; simmer until Brussels sprouts are bright green, 4 to 5 minutes. Remove lid and continue simmering until liquid is evaporated and sprouts are tender, about 5 more minutes.\nRemove skillet from heat and stir bacon, butter, vinegar, salt, and pepper into Brussels sprouts mixture until butter is melted.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7923937.jpg"}, {"title": "The Best Lemon Bars", "total_time": 55, "yields": "1 - 9x13 inch pan", "ingredients": ["1 cup butter, softened", "½ cup white sugar", "2 cups all-purpose flour", "4 eggs", "1 ½ cups white sugar", "¼ cup all-purpose flour", "2 lemons, juiced"], "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, blend together softened butter, 2 cups flour and 1/2 cup sugar.  Press into the bottom of an ungreased 9x13 inch pan.\nBake for 15 to 20 minutes in the preheated oven, or until firm and golden. In another bowl, whisk together the remaining 1 1/2 cups sugar and 1/4 cup flour. Whisk in the eggs and lemon juice. Pour over the baked crust.\nBake for an additional 20 minutes in the preheated oven. The bars will firm up as they cool. For a festive tray, make another pan using limes instead of lemons and adding a drop of green food coloring to give a very pale green. After both pans have cooled, cut into uniform 2 inch squares and arrange in a checker board fashion.", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1394851.jpg"}]